Repository: djvelleman/STG4
Catalog: .i18n/*/Game.po
Languages: es

source: If you have §0, then §1 can be used as a proof of §2, for any statement §3.
es: Si tienes §0, entonces §1 puede usarse como una prueba de §2, para cualquier enunciado §3.

source: Now §0 says §1, which means §2. Of course, this can be simplified to §3. To perform this simplification, you'll need a new tactic, §4. To simplify the assumption §5, write §6.
es: Ahora §0 dice §1, lo que significa §2. Por supuesto, esto se puede simplificar a §3. Para realizar esta simplificación, necesitarás una nueva táctica, §4. Para simplificar la hipótesis §5, escribe §6.

source: Use §0.
es: Usa §0.

source: Suppose §0 and §1 are sets. Then §2 if and only if §3.
es: Si §0 y §1 son conjuntos. Entonces §2 si y solo si §3.

source: This proof is a bit tricky. But you should know how to get started.
es: Esta prueba es un poco difícil. Pero deberías saber como empezar.

source: To work with complements, we'll need to understand negative statements--that is, statements that say that something is *not* the case. If §0 is a statement, then §1 means "it is not the case that §2". To enter the symbol §3, type §4. A common method of proving a negative statement is *proof by contradiction*: to prove a statement of the form §5, you can assume that §6 is true and then show that this assumption leads to a contradiction. The tactic to use for this kind of proof is §7.
es: Para trabajar con complementos, necesitaremos entender declaraciones negativas, es decir, afirmaciones que indican que algo *no* es cierto Si §0 es una afirmación, entonces §1 significa "no es cierto que §2". Para introducir el símbolo §3, escribe §4. Un método común para demostrar una afirmación negativa es la *prueba por contradicción*: para demostrar una afirmación de la forma §5, puedes asumir que §6 es verdadero y luego mostrar que esta suposición conduce a una contradicción. La táctica a utilizar para este tipo de prueba es §7.

source: You can now combine §0 and §1 to reach the goal in one step.
es: Ahora puedes combinar §0 y §1 para alcanzar el objetivo en un solo paso.

source: A union intersected with the complement of an intersection
es: Una unión intersecada con el complemento de una intersección.

source: In this level we'll prove a statement of the form §0. To do this, we'll need another theorem: §1. If you have §2 and §3, then §4 is a proof of §5.
es: En este nivel demostraremos un enunciado de la forma §0. Para hacer esto, necesitaremos otro teorema: §1. Si tienes §2 y §3, entonces §4 es una prueba de §5.

source: Do you see why §0 is the value to use as a witness for §1 in the goal? Your next step can be either §2 or §3.
es: ¿Ves por qué §0 es el valor que se debe usar como testigo para §1 en el objetivo? Tu siguiente paso puede ser §2 o §3.

source: Let §0 be any set. Then §1.
es: Sea §0 un conjunto cualquiera. Entonces §1.

source: Family Intersection World
es: Mundo de las intersecciones de familias

source: Look at what you know about §0 and §1.
es: Mira lo que sabes sobre §0 y §1.

source: Your goal is an existential statement. Do you see what value to use as a witness?
es: Tu objetivo es un enunciado existencial. ¿Ves qué valor usar como testigo?

source: The first case is the easy one.
es: El primer caso es el fácil.

source: Definition of complement
es: Definición de complementario

source: Use §0 again to introduce the assumption §1.
es: Usa §0 otra vez para introducir la suposición §1.

source: Suppose §0 and §1 are families of sets such that for every §2 there is some §3 such that §4, and also there is some §5 such that for every §6, §7. Then §8 and §9 have an element in common.
es: Supongamos que §0 y §1 son familias de conjuntos tales que para todo §2 existe algún §3 tal que §4, y también que existe algún §5 tal que para todo §6, §7. Entonces §8 y §9 tienen algún elemento en común.

source: For working with unions, the important logical word is "or". If §0 and §1 are statements, then §2 means "§3 or §4 or both". To enter the symbol §5, type §6. For the statement §7 to be true, either §8 or §9 must be true. This gives us two ways to prove a statement of this form. If you have §10, then §11 can be used to prove §12. If you have §13, then §14 proves §15.
es: Para trabajar con uniones, la palabra lógica importante es "o". Si §0 y §1 son enunciados, entonces §2 significa "§3 o §4 o ambos". Para escribir el símbolo §5, teclea §6. Para que la declaración §7 sea verdadera, se debe cumplir al menos una de las siguientes condiciones: §8 o §9. Esto nos da dos maneras de probar un enunciado de esta forma. Si tienes §10, entonces §11 puede utilizarse para probar §12. Si tienes §13, entonces §14 demuestra §15.

source: Here's an approach you might try: If only you had §0, then §1 would prove the goal. So if you use the tactic §2, Lean will figure out that §3 could be applied to a proof of §4 to prove the goal, and it will therefore set §5 as your goal.
es: Este es un enfoque que podrías probar: si tuvieras §0, entonces §1 probaría el objetivo. Entonces, si usas la táctica §2, Lean verá que §3 podría aplicarse a una prueba de §4 para probar el objetivo, y por lo tanto establecerá §5 como su objetivo.

source: Subset of family union
es: Subconjuntos de la intersección de una familia

source: If the expression §0 is a proof of a statement of the form §1, then the tactic §2 will replace §3 anywhere that it occurs in the goal with §4. If you want to replace §5 with §6, use §7. (Type §8 to enter the symbol §9.) To do the replacement in an assumption §10, use §11. The §12 tactic can also be used with equations. If §13 is a proof of an equation §14, then §15 will replace §16 with §17 wherever it appears, and §18 will replace §19 with §20. To do multiple replacements, one after another, put a list of proofs inside the brackets, like this: §21.
es: "Si la expresión §0 es una prueba de una afirmación de la forma §1, entonces la táctica §2 reemplazará §3 en cualquier lugar donde aparezca en la meta con §4. Si deseas reemplazar §5 con §6, usa §7. (Escribe §8 para ingresar el símbolo §9.) Para realizar el reemplazo en una suposición §10, usa §11. La táctica §12 también se puede usar con ecuaciones. Si §13 es una prueba de una ecuación §14, entonces §15 reemplazará §16 con §17 dondequiera que aparezca, y §18 reemplazará §19 con §20. Para realizar múltiples reemplazos, uno después de otro, coloca una lista de pruebas dentro de los corchetes, así: §21.

source: Union subset of swap
es: La unión es un subconjunto de la unión conmutada

source: Now that you know §0, you can use that statement as the basis for breaking your proof into cases.
es: Ahora que sabes §0, puedes usar ese enunciado como base para dividir tu prueba en casos.

source: If you have §0, then §1 is a proof of §2. In Mathlib, the name of this theorem is §3.
es: Si tienes §0, entonces §1 es una prueba de §2. En Mathlib, este teorema se llama §3.

source: Complement subsets equivalence
es: Equivalencia de contenido de complementarios

source: Intersection subset of swap
es: La intersección es subconjunto de la intersección permutada

source: This is different from the previous theorem--the roles of union and intersection have been swapped. Once again, there is a tricky shortcut: there is a way to use the theorem from the previous level to prove this theorem. But if you don't see the shortcut, you can use a straightforward approach. If you made it through the last one, you can do this one too!
es: Esto es diferente del teorema anterior, se han intercambiado los papeles de la unión y la intersección. De nuevo, hay un truco: hay una manera de usar el teorema del nivel anterior para probar este teorema. Pero si no ves el atajo, puedes usar un enfoque directo. Si lograste hacerlo con el último, también puedes hacerlo con este.

source: To understand the logic of this proof, it will help to write out the definition of union in §0.
es: Para entender la lógica de esta prueba, ayudará escribir la definición de unión en «{h3}».

source: Set Theory Game
es: Juego de Teoría de Conjuntos

source: In this level, you'll show that, as with intersections, family unions generalize the unions we studied in Union World.
es: En este nivel, demostrarás que, al igual que con las intersecciones, las uniones de familias generalizan las uniones que estudiamos en el mundo de las uniones.

source: §0 means that §1 is a subset of §2. To enter the symbol §3, type §4.
es: §0 significa que §1 es un subconjunto de §2. Para introducir el símbolo §3, teclea §4.

source: Notice that §0 has been added to the list of objects, and the goal has changed to §1. Fortunately, you already know how to prove a goal of this form.
es: Observa que se ha añadido §0 a la lista de objetos, y el objetivo ha cambiado a §1. Afortunadamente, ya sabes cómo demostrar un objetivo de esta forma.

source: Remember that the goal §0 is an abbreviation for §1. As we saw in the last level, we can prove this by coming up with a witness--that is, a value for §2 that will make the statement §3 come out true. Looking at §4 and §5, it looks like §6 would work. That suggests a way to proceed: §7 would prove the goal, if §8 were a proof of §9. In other words, if §10 is applied to a proof of §11, then it will prove the goal. So if you use the tactic §12, then Lean will set §13 as your new goal.
es: Recuerda que el objetivo §0 es una abreviatura para §1. Como vimos en el último nivel, podemos probar esto creando un testigo, es decir, un valor para §2 que haga verdadera la declaración §3. Si miramos §4 y §5, parece que §6 funcionaría. Esto sugiere una forma de proceder: §7 probaría el objetivo, si §8 fuera una prueba de §9. En otros términos, si se aplica §10 a una prueba de §11, entonces probará el objetivo. Por lo tanto, si utilizas la táctica §12, entonces Lean establecerá §13 como tu nuevo objetivo.

source: Welcome to Subset World! In this world you will learn about sets and subsets, and you will also learn the basics of proving theorems in Lean. The elements of the sets in this world will come from a universe called §0. To specify that an object §1 belongs to the universe §2, we write §3. To specify that §4 is a set of objects from §5, we write §6. (The terminology used in Lean is that §7 has *type* §8 and §9 has *type* §10.) To say that §11 is an element of §12, we write §13. (You can enter the symbol §14 by typing §15 or §16, followed by a space.) You will prove theorems in this game by using tools called *tactics*. The aim is to prove the theorem by applying tactics in the right order. Let's learn some basic tactics. Click on "Start" below to get started.
es: ¡Bienvenido al mundo de los subconjuntos!En este mundo, aprenderás sobre conjuntos y subconjuntos, y también aprenderás los conceptos básicos de cómo demostrar teoremas en Lean. Los elementos de los conjuntos en este mundo provendrán de un universo llamado §0.(Lean llama a §1 un *Tipo*.) Para especificar que un objeto §2 pertenece al universo §3,escribimos §4. Para especificar que §5 es un conjunto de objetos de §6, escribimos§7. Para decir que §8 es un elemento de §9, escribimos §10.(Puedes ingresar el símbolo §11 escribiendo §12 o §13, seguido de un espacio).Probarás teoremas en este juego utilizando herramientas llamadas *tácticas*.El objetivo es demostrar el teorema aplicando tácticas en el orden correcto.Aprendamos algunas tácticas básicas. Haz click en \"Start\" a continuación para empezar.

source: # Read this first Each level in this game involves proving a mathematical statement (the "Goal"). When you give a proof of this statement that is accepted by Lean, we say that you have *closed* the goal. In this first level you're going to prove that if §0 belongs to the universe §1, §2 is a set of objects from §3, and §4, then §5. You should see §6, §7, and §8 under *Objects* in the pane to the right, and §9 under *Assumptions*. The letter §10 here is called an *identifier* for the assumption §11. You will prove goals in Lean using *tactics*. The first tactic you're going to learn is called §12, and it is used to close the goal. You can close the goal by typing §13 followed by a proof of the goal.
es: # Empieza leyendo esto Cada nivel en este juego implica demostrar una afirmación matemática (el \"Objetivo\"). Cuando presentas una prueba de esta afirmación que es aceptada por Lean, decimos que has *cerrado* el objetivo. En este primer nivel, vas a demostrar que si §0 pertenece al universo §1, §2 es un conjunto de objetos de §3, y §4, entonces §5. Deberías ver §6, §7, y §8 bajo *Objects* en el panel a la derecha, y §9 bajo *Assumptions*. La letra §10 aquí se llama un *identificador* para la suposición §11. Vas a demostrar objetivos en Lean utilizando *tácticas*. La primera táctica que vas a aprender se llama §12, y se utiliza para cerrar el objetivo. Puedes cerrar el objetivo escribiendo §13 seguido de una prueba del objetivo.

source: Recall that §0 is a proof of §1. So start your proof with §2.
es: Recuerda que §0 es una prueba de §1. Así que puedes empezar tu prueba con §2.

source: Union of larger family is larger
es: La unión de una familia más grande es más grande.

source: Notice that the parentheses in the next goal are necessary, to indicate that the universal quantifier applies only to the subset statement. Without the parentheses, Lean would interpret the universal quantifier as applying to the entire rest of the statement.
es: Fíjate en que los paréntesis en el siguiente objetivo son necesarios, para indicar que el cuantificador universal aplica solo al enunciado del subconjunto. Sin los paréntesis, Lean interpretaría el cuantificador universal como aplicándose al resto de la declaración.

source: You can use the §0 tactic in any proof to assume the opposite of your goal. But it is most useful when the goal starts with the symbol §1. After using the §2 tactic, your goal will be §3. To complete a proof by contradiction, you must prove contradictory statements. If your goal is §4 and you have assumptions §5 and §6, for some statement §7, then §8 will close the goal. Note that §9 won't work; you must list the negative statement first to establish a contradiction.
es: Puedes usar la táctica §0 en cualquier prueba para asumir lo contrario de tu objetivo. Pero es más útil cuando el objetivo comienza con el símbolo §1. Después de usar la táctica §2, tu objetivo será §3. Para completar una prueba por contradicción, debes demostrar afirmaciones contradictorias. Si tu objetivo es §4 y tienes las suposiciones §5 y §6, para alguna afirmación §7, entonces §8 cerrará el objetivo. Ten en cuenta que §9 no funcionará; debes listar la afirmación negativa primero para establecer una contradicción.

source: As we saw in Complement World, a good first step when your goal is an equation between sets is §0. For the theorem in this level, that will leave you with two goals: §1 and §2. Fortunately, you can prove *both* of these goals by using the theorem §3 from the last level.
es: Como vimos en el Mundo de los complementarios, un buen primer paso cuando tu objetivo es una igualdad entre conjuntos es §0. Para el teorema en este nivel, eso te dejará con dos objetivos: §1 y §2. Afortunadamente, puedes probar *ambos* estos enunciados utilizando el teorema §3 del último nivel.

source: The §0 tactic can reexpress a number of different kinds of negative statements as equivalent positive statements; use §1 to reexpress a negative goal, and §2 to reexpress a negative assumption §3. We'll see many more uses of the §4 tactic in this game. For more details about the use of these tactics, click on §5 or §6 under the list of tactics on the right. We have given this theorem the name §7. Both this theorem and the one in the previous level will be useful in the next level.
es: La táctica §0 puede reexpresar distintas declaraciones negativas como positivas; usa §1 para reexpresar un objetivo negativo, y §2 para reexpresar una suposición negativa §3. Veremos muchos más usos de la táctica §4 en este juego. Para obtener más detalles sobre el uso de estas tácticas, haz click en §5 o §6 bajo la lista de tácticas a la derecha. Hemos dado a este teorema el nombre §7. Tanto este teorema como el del nivel anterior serán útiles en el siguiente nivel.

source: Let §0 be an object in the universe §1, and let §2 be a set whose elements come from §3. Then §4.
es: Sea §0 un objeto en el universo §1, y sea §2 un conjunto cuyos elementos proceden de §3. Entonces §4.

source: If you have §0, then §1 is defined to be the set of all objects in the universe §2 that are not elements of §3. That means that if you also have §4, then the statements §5 and §6 are equivalent. We express this by saying that the statement §7 is true. (The symbol §8 means "if and only if", and you can enter it by typing §9. You can enter the superscript §10 in the notation for the complement of a set by typing §11 or §12.) In this level, we're going to prove that the statement §13 is true, and to do it we'll use a new tactic: §14. The §15 tactic can prove any statement of the form §16 if §17 and §18 are statements that are equivalent by virtue of the definitions of the symbols occurring in them. (We say in this case that §19 and §20 are *definitionally equivalent*.) The §21 tactic can also prove statements of the form §22, if §23 and §24 are definitionally equal--that is, equal by virtue of definitions.
es: Si tienes §0, entonces §1 se define como el conjunto de todos los objetos en el universo §2 que no son elementos de §3. Esto significa que si también tienes §4, entonces las afirmaciones §5 y §6 son equivalentes. Expresamos esto diciendo que la afirmación §7 es verdadera. (El símbolo §8 significa \"si y solo si\", y puedes introducirlo escribiendo §9. Puedes ingresar el superíndice §10 en la notación para el complemento de un conjunto escribiendo §11 o §12.) En este nivel, vamos a demostrar que la afirmación §13 es verdadera, y para hacerlo usaremos una nueva táctica: §14. La táctica §15 puede demostrar cualquier afirmación de la forma §16 si §17 y §18 son afirmaciones que son equivalentes por virtud de las definiciones de los símbolos que aparecen en ellas. (Decimos en este caso que §19 y §20 son *equivalentes por definición*.) La táctica §21 también puede demostrar afirmaciones de la forma §22, si §23 e §24 son iguales por definición.

source: Once again, the use of §0 was not really necessary. You could prove this theorem with the single step §1.
es: De nuevo, el uso de §0 no era realmente necesario. Puedes probar este teorema con un solo paso usando §1.

source: It looks like §0 could get you to the goal, if only you knew that §1. Can you prove that?
es: Parece que §0 podría llevarte al objetivo si supieras que §1. ¿Puedes probarlo?

source: First use §0 to assert that §1, and then prove §2.
es: Usa §0 para afirmar que §1, y después demuestra §2.

source: Of course, you could start the proof in this level with either §0 or §1. But there is a shorter solution: you can use the theorem from the previous level (§2) to prove the theorem in this level. The trick to get started on this proof is to rewrite §3 as §4. As you know, §5 is a proof of the theorem §6, and therefore §7 could be used to rewrite §8 as §9; but we want to go in the opposite direction, rewriting §10 as §11. To do that, use §12. (To enter the left-pointing arrow, type §13.)
es: Por supuesto, podrías empezar la prueba en este nivel con §0 o §1. Pero hay una solución más corta: puedes utilizar el teorema del nivel anterior (§2) para probar el teorema en este nivel. El truco para empezar esta prueba es reescribir §3 como §4. Como sabes, §5 es una prueba del teorema §6, y por lo tanto §7 podría usarse para rewriting §8 como §9; pero queremos ir en la dirección opuesta: reescribir §10 como §11. Para hacer eso, utiliza §12. (Para introducir la flecha hacia la izquierda, escribe §13).

source: Complement subsets from subsets
es: Conjuntos complementaros de subconjuntos

source: For any sets §0 and §1, §2.
es: Para cualesquiera conjuntos §0, §1y §2.

source: You'll be able to use the theorem §0 in the next level to prove that union is commutative.
es: En el siguiente nivel podrás utilizar el teorema §0 para probar que la unión es conmutativa.

source: Here's an idea that you may find helpful for this proof: If you're proving an "or" statement and you think you'll be able to prove either the left or right side of the statement, then §0 or §1 will set the goal to be the left or right side. Alternatively, the tactic §2 has the same effect as §3, and §4 has the same effect as §5. You can start this proof with either §6 or §7.
es: Aquí tienes una idea que tal vez te sea útil para esta prueba: Si estás probando una declaración "o" y crees que podrás probar el lado izquierdo o derecho de la declaración, entonces §0 o §1 establecerá el lado izquierdo o derecho como objetivo. Alternativamente, la táctica §2 tiene el mismo efecto que §3, y §4 tiene el mismo efecto que §5. Puedes empezar esta prueba con §6 o §7.

source: For any sets §0, §1, and §2, §3.
es: Para cualesquiera conjuntos §0, §1, §2 y §3.

source: The name of the tactic §0 is short for "reflexivity", which is the property of both §1 and §2 that is the basis for the tactic. We have given the theorem proven in this level the name §3. In the next level, we will see how we can use it to prove theorems about complements.
es: Hemos llamado al teorema demostrado en este nivel §0, porque expresa la definición del complementario. En el siguiente nivel veremos cómo usarlo para demostrar teoremas sobre complementarios.

source: Use §0 to introduce either a new assumption or a new object into your proof. There are two situations in which you can use the §1 tactic: * If you are proving a statement of the form §2, then you can use the tactic §3 to introduce the assumption §4 and set §5 as the goal. Be sure to use an identifier that is not already in use. * If you are proving a statement of the form §6, where §7 is some statement about §8, then you can use the tactic §9 to introduce a new object §10 into the proof. Be sure to use a variable name that is not already in use. The goal will then be §11. You can do multiple introductions in one step: for example, §12 has the same effect as doing §13 followed by §14.
es: Usa §0 para introducir ya sea una nueva suposición o un nuevo objeto en tu prueba. Hay dos situaciones en las que puedes usar la táctica §1: * Si estás demostrando una afirmación de la forma §2, entonces puedes usar la táctica §3 para introducir la suposición §4 y establecer §5 como la meta. Asegúrate de usar un identificador que no esté en uso. * Si estás demostrando una afirmación de la forma §6, donde §7 es una afirmación sobre §8, entonces puedes usar la táctica §9 para introducir un nuevo objeto §10 en la prueba. Asegúrate de usar un nombre de variable que no esté en uso. El objetivo pasará a ser §11. Puedes realizar múltiples introducciones en un solo paso: por ejemplo, §12 tiene el mismo efecto que realizar §13 seguido de §14.

source: A subset of a union intersected with the complement of another
es: Un subconjunto de la unión intersecada con el complemento de otra

source: Complement World
es: Mundo de los complementarios

source: Here's a theorem about three related families of sets.
es: Aquí hay un teorema sobre tres familias de conjuntos relacionadas.

source: Complement of a family union
es: Complementario de la unión de una familia
