Repository: djvelleman/STG4
Catalog: .i18n/*/Game.po
Languages: es

source: Fortunately, the theorem §0 can now be used to prove the goal. (Click on §1 in the list of theorems on the right if you don't remember what the theorem says.)
es: Por suerte, el teorema §0 puede usarse ahora para probar el objetivo. (Haz click en §1 en la lista de teoremas a la derecha si no recuerdas qué dice el teorema.)

source: If your goal is §0, where §1 represents some statement about §2, and §3 is a value that could be assigned to §4, then the tactic §5 will set §6 to be the goal. It will then see if this new goal follows easily from your assumptions, and if so it will close the goal.
es: Si tu objetivo es §0, donde §1 representa alguna afirmación sobre §2, y §3 es un valor que podría asignarse a §4, entonces la táctica §5 establecerá §6 como objetivo. Luego verá si este nuevo objetivo se sigue fácilmente de sus suposiciones, y si es así, cerrará el objetivo.

source: To work with unions of families, we'll need to know how to work with existential statements. If §0 is a statement about an unspecified object §1, then §2 means "there is at least one §3 such that §4 is true". The symbol §5 is called the *existential quantifier*, and you can enter it in Lean by typing §6. The easiest way to prove the statement §7 is to specify a value of §8, and give a proof of §9 for that value of §10. The theorem that allows you to do that is called §11. If you have §12, for some object §13, then §14 is a proof of the statement §15. (The object §16 is sometimes called a *witness* for the existential statement.) In this level, you'll try out this theorem.
es: Para trabajar con uniones de familias, necesitaremos saber cómo trabajar con enunciados existenciales. Si §0 es un enunciado acerca de un objeto no especificado §1, entonces §2 significa "existe al menos un §3 tal que §4 es verdadero". El símbolo §5 se llama el *cuantificador existencial*, y puedes obtenerlo en Lean tecleando §6. La forma más fácil de probar el enunciado §7 es especificar un valor para §8, y dar una prueba de §9 para ese valor de §10. El teorema que permite hacer esto se llama §11. Si tienes §12, para algún objeto §13, entonces §14 es una prueba del enunciado §15. (El objeto §16 a veces se llama un *testigo* para el enunciado existencial.) En este nivel, intentarás probar este teorema.

source: Suppose §0 and §1 are sets. Then §2.
es: Supongamos que §0 y §1 son conjuntos. Entonces §2.

source: What set can you apply §0 to?
es: ¿A qué conjunto puedes aplicar «{h1}»?

source: If §0 denotes some object, then §1 denotes the set whose only element is §2; such a set is called a *singleton* set. Similarly, if §3 and §4 denote objects, then §5 denotes the set whose elements are §6 and §7, and nothing else. (Similar notation can be used to denote a set containing any finite list of objects. All of the objects in the list must have the same type; if the objects have type §8, then the set has type §9.) There is another way to define sets. If §10 is a statement about an unspecified object §11, then §12 denotes the set of all values of §13 that make §14 come out true. This is often called *set-builder notation*.
es: Si §0 denota algún objeto, entonces §1 denota el conjunto cuyo único elemento es §2; tal conjunto se llama un *conjunto unitario*.De manera similar, si §3 y §4 denotan objetos, entonces §5 denota el conjunto cuyos elementos son §6 y §7, y nada más. (Notaciónsimilar puede utilizarse para denotar un conjunto que contiene cualquier lista finita de objetos. Todos los objetos en la lista debentener el mismo tipo; si los objetos tienen tipo §8, entonces el conjunto tiene tipo §9.)Existe otra forma de definir conjuntos. Si §10 es una declaración sobre algún objeto no especificado §11, entonces §12 denota elconjunto de todos los valores de §13 que hacen que §14 sea verdadera. Esto se conoce a menudo como *notación de conjuntos por comprensión*.

source: This level is an exercise in handling sequences of quantifiers that alternate between §0 and §1. A good way to start is to decide which assumption to use first.
es: Este nivel es un ejercicio para manejar secuencias de cantidades que alternan entre §0 y §1. Una buena forma de empezar es decidir qué suposición utilizar primero.

source: Proving existential statements
es: Probar enunciados existenciales

source: Now your goal starts with §0. To prove it, you'll need to introduce a set §1 into the proof, using the tactic §2. Recall that the set §3 is *arbitrary*--that is, §4 could stand for any set--so whatever we prove about §5 will be true for *all* sets §6.
es: Ahora tu objetivo empieza con §0. Para probarlo, necesitarás introducir un conjunto §1 en la prueba, utilizando la táctica §2. Recuerda que el conjunto §3 es *arbitrario*--es decir, §4 podría representar cualquier conjunto--así que lo que demostremos sobre §5 será verdadero para *todos* los conjuntos §6.

source: Writing out the meaning of intersection in the goal will help you see what to do to complete this level.
es: Escribir el significado de la intersección en el objetivo te ayudará a ver lo que tienes que hacer para completar este nivel.

source: As with complements and intersections, one of the key tools for proving theorems about unions is a theorem stating the definition. If you have §0, §1, and §2, then §3 is a proof of the statement §4. That means you can use §5 to write out the definition of §6 if it appears in any assumption or the goal. (The similar theorem about intersections was called §7. Why isn't this one called §8? I don't know. The naming of theorems in Lean is systematic, but there are occasional surprises.)
es: Como con los complementarios e intersecciones, una de las herramientas clave para probar los teoremas sobre uniones es un teorema que establece la definición. Si tienes §0, §1 y §2, entonces §3 es una prueba del enunciado §4. Eso significa que puedes usar §5 para escribir la definición de §6 si aparece en alguna suposición o el objetivo. (El teorema similar sobre intersecciones se llamaba §7. ¿Por qué no se llama a este §8? No lo sé. La denominación de los teoremas en Lean es sistemática, pero de vez en cuando hay sorpresas.)

source: Complement of a family intersection
es: Complementario de la intersección de una familia

source: In this level, your goal is §0--that is, the complement of §1 is equal to §2. So §3 is a good way to start.
es: En este nivel, tu objetivo es §0--eso significa que el complementario de §1 es igual a §2--. Así que §3 es una buena manera de empezar.

source: Since §0 is a proof of §1, you can close the goal with §2.
es: Como §0 es una prueba de §1, puedes cerrar el objetivo con §2.

source: The proof in this level illustrates how previously proven theorems can be used in proofs. There is another tactic you can use if your goal has the form §0. In this situation, the tactic §1 will have the same effect as §2; that is, it will set §3 and §4 as goals to be proven.
es: La prueba en este nivel ilustra cómo se pueden utilizar en una prueba teoremas previamente demostrados. Existe otra táctica que puedes usar si tu objetivo tiene la forma §0. En esta situación, la táctica §1 tendrá el mismo efecto que §2; es decir, establecerá §3 y §4 como objetivos a ser probados.

source: Now use §0 to assert that §1. If you don't see right away how to justify this assertion, you can just write §2 and Lean will set §3 as your immediate goal. Once you achieve that goal, Lean will add §4 to your list of assumptions, and you can continue with the proof of your original goal. For further details, click on §5 in the list of tactics on the right.
es: Ahora usa §0 para afirmar que §1. Si no ves de inmediato cómo justificar esta afirmación, puedes escribir simplemente §2 y Lean establecerá §3 como tu objetivo inmediato. Una vez que hayas logrado ese objetivo, Lean agregará §4 a tu lista de hipótesis y podrás continuar con la prueba de tu objetivo original. Para obtener más detalles, haz clic en §5 en la lista de tácticas a la derecha.

source: How do we prove that two sets §0 and §1 are equal? One way to do it is to use the theorem §2. This theorem is pre-defined in this game; you don't need to prove it. If you have §3 and §4, then §5 is a proof of §6. The theorem §7 says that the subset relation has a property called *antisymmetry*. But what if you don't already know §8 and §9? In that case, you can use a new tactic, §10. If your goal is §11 and you write §12, then Lean will figure out that the theorem §13 could be applied to prove the goal, if only you had proofs of §14 and §15. So it will set those *two* statements as goals. If your goal says that two sets are equal, a good way to begin is with §16. (Later we'll see a second approach to proving sets are equal.) This level also introduces another new tactic, §17.
es: ¿Cómo demostramos que dos conjuntos §0 y §1 son iguales? Una manera de hacerlo es utilizar el teorema §2. Este teorema está predefinido en este juego; no necesitas probarlo. Si tienes §3 y §4, entonces §5 es una prueba de §6. El teorema §7 dice que la relación de subset tiene una propiedad llamada *antisimetría*. Pero ¿qué pasa si aún no sabes que §8 y §9? En ese caso, puedes usar una nueva táctica, §10. Si tu objetivo es §11 y escribes §12, entonces Lean verá que el teorema §13 podría aplicarse para probar el objetivo, si tuvieras pruebas de §14 y §15. Entonces establecerá esos *dos* enunciados como objetivos a demostrar. Si tu objetivo dice que dos conjuntos son iguales, una buena manera de empezar es con §16. (Más tarde veremos un segundo enfoque para probar que los conjuntos son iguales.) Este nivel también introduce otra nueva táctica, §17.

source: There is more than one way to do the proof in this level. Since the proof involves complements of sets, negative statements will arise in the course of the proof. This suggests two possible techniques. You may be able to use the §0 tactic to reexpress some negative statements as equivalent positive statements. And you may find proof by contradiction useful.
es: Existe más de una forma de realizar la prueba en este nivel. Dado que la prueba implica complementarios de conjuntos, aparecerán enunciados negativos durante el curso de la prueba. Esto sugiere dos posibles técnicas. Se puede usar la táctica §0 para reexpresar algunos enunciados negativos como equivalentes positivos. O se puede usar encontrar la prueba por contradicción.

source: In the last level, you proved the theorem §0. If you have §1 and §2, then §3 is a proof of the statement §4. You could think of the statement §5 as saying that if §6 occurs anywhere in a proof, you can replace it with §7. There is a tactic called §8 that can be used to perform such replacements. You'll get to try out the §9 tactic in this level.
es: En el último nivel, demostraste el teorema §0. Si tienes §1 y §2, entonces §3 es una prueba de la afirmación §4. Podrías pensar en la afirmación §5 como decir que si §6 ocurre en cualquier parte de una prueba, puedes reemplazarlo con §7. Hay una táctica llamada §8 que se puede usar para realizar tales reemplazos. Tendrás la oportunidad de probar la táctica §9 en este nivel.

source: Suppose §0, and §1 is any set. Then §2.
es: Supongamos §0, y que §1 es un conjunto. Entonces §2.

source: Suppose §0 and §1 are families of sets and §2. Then §3.
es: Supongamos que §0 y §1 son familias de conjuntos, y §2. Entonces §3.

source: Union World
es: Mundo de las uniones

source: Let §0 be an object from the universe §1, and let §2, §3, and §4 be sets such that §5 and §6. Then §7.
es: Sea §0 un objeto del universo §1, y sean §2, §3 y §4 conjuntos tales que §5 y §6. Entonces §7.

source: It will help you see how to proceed if you write out the definition of union in both the assumption §0 and the goal.
es: Te puede ser útil escribir la definición de unión tanto en la hipótesis §0 como en el objetivo.

source: In general, if you think that some theorem §0 could be used to prove the goal, the tactic §1 will work backwards from the goal, setting as new goals any hypotheses that are needed for the application of the theorem §2. If your goal has the form §3, then the §4 tactic will have the same effect as §5; that is, it will set §6 and §7 as goals to be proven.
es: En general, si crees que algún teorema §0 podría usarse para probar el objetivo, la táctica §1 funcionará hacia atrás desde el objetivo, estableciendo como nuevos objetivos las hipótesis que sean necesarias para la aplicación del teorema §2. Si tu objetivo tiene la forma §3, entonces la táctica §4 tendrá el mismo efecto que §5; es decir, establecerá §6 y §7 como objetivos para ser probados.

source: §0 means "§1 or §2 or both". To enter the symbol §3, type §4. ### If your goal is §5 If you have §6, then §7 is a proof of §8, so §9 will close the goal. Similarly, if you have §10, then §11 is a proof of §12. If you don't have a proof of either §13 or §14, but you think you know which one is true, then you can use §15 to set the goal to be §16, or §17 to set the goal to be §18. Alternatively, the tactic §19 will have the same effect as §20, and §21 will have the same effect as §22. ### If you have an assumption §23 A good strategy would be to use proof by cases. The tactic §24 will break the proof into two cases. In case 1, the assumption §25 is replaced by §26, and in case 2 it is replaced by §27. In both cases, you must prove the goal.
es: §0 significa "§1 o §2 o ambos". Para introducir el símbolo §3, teclea §4. ### Si tu objetivo es §5 Si tienes §6, entonces §7 es una prueba de §8, así que §9cerrará el objetivo. De manera similar, si tienes §10, entonces §11 es una pruebade §12. Si no tienes una prueba ni de §13 ni de §14, pero crees saber cuál es la verdadera, puedes usar §15 para establecer elobjetivo como §16, o bienusar §17 para establecer el objetivo como §18. Opcionalmente, la táctica §19 tendrá el mismo efecto que §20, y §21 tendrá el mismo efecto que§22. ### Si tienes una hipótesis §23 Una buena estrategia sería usar demostración por casos. La táctica §24dividirá la prueba en dos casos. En caso 1, la suposición §25 será reemplazada por§26, y en el caso 2 será reemplazada por §27. En ambos casos, debes probar el objetivo.

source: Suppose §0 is a set and §1 is a family of sets. Then §2.
es: Supón que §0 es un conjunto, y §1 es una familia de conjuntos. Entonces §2.

source: For any sets §0 and §1, §2 is a proof of §3.
es: Para cualesquiera conjuntos §0 y §1, §2 es una prueba de §3.

source: *Game version: 4.4* ## Progress saving The game stores your progress in your local browser storage. If you delete it, your progress will be lost! Warning: In most browsers, deleting cookies will also clear the local storage (or "local site data"). Make sure to download your game progress first! ## Credits * **Creator:** Daniel J. Velleman; based on the Natural Numbers Game, by Kevin Buzzard * **Game Engine:** Alexander Bentkamp, Jon Eugster, Patrick Massot * **Spanish Translation:** Miguel Marco ## Resources * The [Lean Zulip chat](https://leanprover.zulipchat.com/) forum ## Problems? Please ask any questions about this game in the [Lean Zulip chat](https://leanprover.zulipchat.com/) forum, for example in the stream "New Members". The community will happily help. Note that the Lean Zulip chat is a professional research forum. Please use your full real name there, stay on topic, and be nice. If you're looking for somewhere less formal (e.g. you want to post set theory game memes) then head on over to the [Lean Discord](https://discord.gg/WZ9bs9UCvx). Alternatively, if you experience issues / bugs you can also open github issues: * For issues with the game engine, please open an [issue at the lean4game repo](https://github.com/leanprover-community/lean4game/issues). * For issues about the game's content, please open an [issue at the STG repo](https://github.com/djvelleman/STG4/issues).
es: *Versión del juego: 4.4* ## Almacenamiento de progreso El juego almacena tu progreso en el almacenamiento local de tu navegador. Si lo eliminas, perderás tu progreso! Atención: En la mayoría de los navegadores, eliminar las cookies también limpiará el almacenamiento local (o "datos del sitio local"). Asegúrese de descargar su progreso en el juego primero! ## Créditos * **Creador:** Daniel J. Velleman; basado en el Juego de números naturales, por Kevin Buzzard * **Motor del juego:** Alexander Bentkamp, Jon Eugster, Patrick Massot * **Traducción al español:** Miguel Marco ## Recursos * El [Lean Zulip chat](https://leanprover.zulipchat.com/) foro ## Problemas? Por favor, pregunte cualquier duda sobre este juego en el[Lean Zulip chat](https://leanprover.zulipchat.com/) foro, por ejemplo en el flujo "Miembros nuevos". La comunidad estará encantada de ayudar. Note que el Lean Zulip chat es un foro de investigación profesional.Por favor, use su nombre completo y real allí, céntrese en el tema y sea amable. Si está buscando un lugar menos formal (por ejemplo, desea publicar memes del juego de la teoría de conjuntos)entonces diríjase al [Lean Discord](https://discord.gg/WZ9bs9UCvx). Alternativamente, si experimenta problemas / errores puede abrir issues en github: * Para problemas con el motor del juego, por favor abra un[issue en el repo de lean4game](https://github.com/leanprover-community/lean4game/issues). * Para problemas sobre el contenido del juego, por favor abra un[issue en el repo STG](https://github.com/djvelleman/STG4/issues).

source: As you saw in the previous level, you can now apply §0 to §1 to justify asserting §2, using the §3 tactic.
es: Como vimos en el nivel anterior, puedes aplicar §0 a §1 para justificar que §2, usando la táctica §3.

source: Now your situation is similar to the previous level.
es: Ahora tu situación es similar al nivel anterior.

source: You've finished Combination World!
es: ¡Terminaste el mundo Combinado!

source: In this level, we have assumptions §0, §1, and §2. As we saw in the last level, §3 is a proof that §4. Unfortunately, that is not the goal, so we can't use §5 to close the goal. However, we can use the proof §6 to justify adding §7 to our list of assumptions. To do that, we'll use a new tactic: §8.
es: En este nivel, tenemos las hipótesis §0, §1, y §2. Como vimos en el nivel anterior, §3 es una prueba de que §4. Lamentablemente, ese no es el objetivo, así que no podemos usar §5 para cerrar el objetivo. Sin embargo, podemos usar la prueba §6 para justificar agregar §7 a nuestra lista de suposiciones. Para hacer eso, usaremos una nueva táctica: §8.

source: If your goal is §0, where §1 and §2 are sets, then the tactic §3 will introduce a new arbitrary object §4 into the proof and set the goal to be §5.
es: Si tu objetivo es §0, donde §1 y §2 son conjuntos, entonces la táctica §3 introducirá un nuevo objeto §4 arbitrario en la prueba y §5 como nuevo objetivo.

source: The assumption §0 is now an existential statement. Thus, §1 will introduce a new object §2 and a new assumption §3 into the proof. Once the witness §4 has been introduced, the assumption §5 becomes redundant, so it is deleted.
es: La suposición «{h2}» ahora es un enunciado existencial. Por lo tanto, §0 introducirá un nuevo objeto §1 y una nueva hipótesis §2 en la prueba. Una vez que se ha introducido el testigo §3, la suposición «{h2}» se vuelve redundante, por lo que se elimina.

source: If you start your proof with §0, then you'll be able to use the theorem §1 that you proved in the last level.
es: Si comienzas tu prueba con §0, podrás usar el teorema §1 que demostraste en el último nivel.

source: Suppose that for every §0 there is some §1 such that §2. Then §3.
es: Supongamos que para cada §0 existe algún §1 tal que §2. Entonces §3.

source: Subset of an intersection
es: Subconjuntos de una intersección

source: Proof by contradiction
es: Demostración por contradicción

source: Since your goal is an "if-then" statement, a good next step is §0.
es: Como tu objetivo es un enunciado de tipo "si-entonces", un buen siguiente paso es §0.

source: In this world we combine family unions and intersections with each other, and with complements. This level contains some of the hardest proofs in the game!
es: En este mundo combinamos uniones e intersecciones de familias entre sí y con complementos. Este nivel contiene algunas de las pruebas más difíciles del juego!

source: Family Combination World
es: Mundo combinado de familias.

source: Suppose §0 is a set and §1 is a family of sets. Then §2 is a subset of §3 if and only if §4 is a subset of every element of §5.
es: Supongamos que §0 es un conjunto y §1 una familia de conjuntos. Entonces §2 es un subconjunto de §3 si y solo si §4 es un subconjunto de cada elemento de §5.

source: In the next level we're going to prove that intersection is commutative; that is, §0. As a warm-up, in this level we prove §1.
es: En el siguiente nivel vamos a probar que la intersección es conmutativa; es decir, §0. Como calentamiento, en este nivel probaremos §1.

source: Well done! You're ready to move on to Union World.
es: ¡Bien hecho! Estás listo para pasar al mundo de la uniones.

source: Family intersection is subset
es: La intersección de una familia es un subconjunto

source: Now your goal is a negative statement, so try proof by contradiction.
es: Ahora tu objetivo es una negación, así que intenta demostrarlo por contradicción.

source: It will help you see how to proceed if you write out the definition of intersection in both the assumption «{h}» and the goal. Using the §0 tactic isn't necessary; you can just do the rewriting in your head rather than asking Lean to do it. But if it helps you to figure out the proof, go ahead and use the §1 tactic.
es: Te ayudará a ver cómo proceder si escribes la definición de intersección tanto en la hipótesis «{h}» como en el objetivo. Usar la táctica §0 no es necesario; puedes hacer las sustituciones en tu cabeza en lugar de pedirle a Lean que lo haga. Pero si te ayuda a entender la prueba, adelante y usa la táctica §1.

source: Perhaps you have already guessed that there is a theorem about the complement of an intersection of a family that is similar to the theorem in the last level.
es: Quizás ya adivinaste que hay un teorema sobre el complemento de una intersección de una familia que es similar al teorema en el último nivel.

source: Writing out the meaning of the goal will make the proof easier to understand.
es: Escribir el significado del objetivo facilitará la comprensión de la prueba.

source: To get started, you'll need to introduce first an object §0 and then the assumption that §1.
es: Para empezar, hay que introducir un objeto §0 y la hipótesis de que §1.

source: level completed! 🎉
es: ¡Nivel completado!

source: Use §0 to close a goal. If some expression §1 is a proof of the goal, then §2 will close the goal. Think of "exact" as meaning "this is exactly what is needed to prove the goal."
es: Utiliza §0 para cerrar un objetivo. Si alguna expresión §1 es una prueba del objetivo, entonces §2 cerrará el objetivo. Puedes pensar que "exact" significa "esto es exactamente lo que se necesita para demostrar el objetivo."

source: For the second case, which half of the goal do you think you should try to prove? You can use §0 or §1 (or the equivalent tactics §2 or §3) to specify what goal you're going to prove.
es: Para el segundo caso, ¿qué mitad del objetivo crees que deberías intentar probar? Puedes usar §0 o §1 (o las tácticas equivalentes §2 o §3) para especificar qué objetivo vas a probar.
