Repository: djvelleman/STG4
Catalog: .i18n/*/Game.po
Languages: es

source: Suppose §0 is a set. Then §1.
es: Supongamos que §0 es un conjunto. Entonces §1.

source: Suppose §0 is a set, and for every family of sets §1, if §2 then §3. Then §4 must be a singleton set.
es: Supongamos que §0 es un conjunto, y que para toda familia de conjuntos §1, si se cumple §2 se cumple §3. Entonces §4 debe ser un conjunto de un solo elemento.

source: A game about set theory.
es: Un juego sobre la teoría de conjuntos.

source: §0 is a proof of §1.
es: §0 es una prueba de §1.

source: This proof is longer than previous ones, but it doesn't require any new tactics or theorems. Just stick with it and keep applying the ideas from previous levels!
es: Esta comprobación es más larga que las anteriores, pero no requiere ninguna nueva táctica o teorema. Solo sigue adelante y sigue aplicando las ideas de niveles anteriores.

source: Now your goal is an if-then statement; that means §0 is appropriate again, to introduce §1 as a new assumption.
es: Ahora tu objetivo es un enunciado si-entonces; eso significa que §0 vuelve a ser apropiado para introducir §1 como una nueva hipótesis.

source: §0 is the intersection of the family of sets §1. To enter the symbol §2, type §3.
es: §0 es la intersección de la familia de conjuntos §1. Para ingresar el símbolo §2, escribe §3.

source: The second goal is similar, but a little trickier.
es: El segundo objetivo es similar, pero un poquito más difícil.

source: If §0 and §1 are families of sets, what is §2? In this level, you'll find out!
es: Si §0 y §1 son familias de conjuntos, ¿qué es §2? En este nivel, lo veremos.

source: §0 means "§1 and §2". To enter the symbol §3, type §4. ### If your goal is §5 If you have §6 and §7, then §8 is a proof of §9, so §10 will close the goal. If you don't yet have proofs of §11 and §12, then §13 will set §14 and §15 as separate goals. In this situation, the tactic §16 has the same effect as §17. ### If you have an assumption §18 Lean will recognize §19 as a proof of §20 and §21 as a proof of §22.
es: §0 significa "§1 y §2". Para introducir el símbolo §3, escribe §4. ### Si tu objetivo es §5 Si tienes §6 y §7, entonces §8 es una prueba de §9,así que §10 cerrará el objetivo.Si aún no tienes pruebas de §11 y §12, entonces §13 establecerá a §14 y §15como objetivos separados. En esta situación, la táctica §16 tiene el mismo efecto que§17. ### Si tienes una suposición §18 Lean reconocerá §19 como una prueba de §20 y §21 como una prueba de §22.

source: Notice that you haven't used §0 yet...
es: Fíjate que aún no has utilizado §0...

source: There is another tactic you could have used to complete this proof. Instead of §0, you could write §1. The §2 tactic is actually a powerful tactic. Not only does it fill in §3 for §4 in the existential goal, it then tries to complete the proof on its own--and in this case, it would have succeeded!
es: Hay otra táctica que podrías haber utilizado para completar esta prueba. En lugar de §0, podrías escribir §1. La táctica §2 es una táctica muy potente. No solo sustituye §3 como §4 en el objetivo existencial, sino que luego intenta completar la prueba por su cuenta y, en este caso, habría tenido éxito!

source: You might be tempted to use §0 as your next step. But in this situation, §1 is ambiguous, because there are two ways that the theorem §2 could be applied to rewrite the goal: §3 is a proof of §4 and §5 is a proof of §6, and either one of those equations could be used to rewrite the goal. If you say §7, then Lean will pick one of those two rewriting steps, and it might not pick the one you wanted. So you'd better say explicitly what you want Lean to apply the theorem §8 to.
es: Quizás puedas estar tentado a usar §0 como tu siguiente paso. Pero en esta situación, §1 es ambiguo, ya que hay dos maneras en que el teorema §2 podría ser aplicado para reescribir el objetivo: §3 es una prueba de §4 y §5 es una prueba de §6, y cualquiera de esas ecuaciones podría ser utilizada para reescribir el objetivo. Si usas §7, entonces Lean elegirá uno de esos dos pasos de reescritura, y puede que no elija el que querías. Así que es mejor decir explícitamente a que quieres que Lean aplique el teorema §8.

source: In the next level we're going to prove that union is commutative; that is, §0. We're going to imitate the approach we used in Intersection World to prove that intersection is commutative. We begin by proving §1.
es: En el siguiente nivel vamos a probar que la unión es conmutativa; es decir, §0. Vamos a imitar el enfoque que utilizamos en el Mundo de las Intersecciones para probar que la intersección es conmutativa. Comenzamos demostrando §1.

source: Suppose §0 and §1. Then §2.
es: Supongamos §0 y §1. Entonces §2.

source: If your goal is a negative statement, then the tactic §0 will try to reexpress it as an equivalent positive statement. Similarly, if an assumption §1 is a negative statement, then §2 will try to reexpress §3. Here are some examples of reexpressions performed by the §4 tactic: * §5 is converted to §6. * §7 is converted to §8. * §9 is converted to §10. * §11 is converted to §12. * §13 is converted to §14. * §15 is converted to §16.
es: Si tu objetivo es un enunciado negativo, entonces la táctica §0 intentará reexpresarlo como un enunciado equivalente positivo. De manera similar, si una hipótesis §1 es un enunciado negativo, entonces §2 intentará reexpresar §3. Aquí hay algunos ejemplos de reexpresiones realizadas por la táctica §4: * §5 se convierte en §6. * §7 se convierte en §8. * §9 se convierte en §10. * §11 se convierte en §12. * §13 se convierte en §14. * §15 se convierte en §16.

source: Let §0 be an object in the universe §1, and let §2 be a set whose elements come from §3. Suppose that §4. Then §5.
es: Sea §0 un objeto en el universo §1, y sea §2 un conjunto cuyos elementos proceden de §3. Supón que §4 Entonces §5.

source: Union subset of a set
es: La unión como subconjunto de un conjunto

source: Notice that §0 is now listed under *Assumptions*, and your new goal is §1.
es: Fíjate en que §0 aparece ahora en el apartado *Assumptions*, y tu nuevo objetivo es §1.

source: We have given this theorem the name §0. Thus, from now on, for any sets §1 and §2, §3 is a proof of §4.
es: Le hemos dado a este teorema el nombre de §0. Por lo tanto, desde ahora en adelante, para cualesquiera conjuntos §1 y §2, §3 es una prueba de §4.

source: Intersection World
es: Mundo de las intersecciones

source: This should remind you of the first level of this world. To get a contradiction, try to contradict §0.
es: Esto debería recordarte el primer nivel de este mundo. Para obtener una contradicción, intenta contradecir §0.

source: If your goal has the form §0, then the tactic §1 will set your goal to be §2. There are other situations in which the §3 tactic can be used, but this is the one that is most relevant for the set theory game.
es: Si tu objetivo es de la forma §0, entonces la táctica §1 establecerá §2 como tu objetivo.Hay otras situaciones en las que se puede utilizar la táctica §3, pero esta esla más relevante para el juego de teoría de conjuntos.

source: Intersection is commutative
es: La intersección es conmutativa.

source: What happens if the subset statement in the last level is reversed?
es: ¿Qué sucede si se invierte la relación de contenido en el último nivel?

source: The last two steps could have been combined into one step. In general, if you have §0 and §1, where §2 is some statement about §3, then §4 is a proof of §5, and applying that proof to §6 we conclude that §7 is a proof of §8. For example, if you have §9 and §10, then §11 is a proof of §12.
es: Los últimos dos pasos podrían haberse combinado en un solo paso. En general, si tienes §0 y §1, donde §2 es algún enunciado sobre §3, entonces §4 es una prueba de §5, y aplicando esa prueba a §6 concluimos que §7 es una prueba de §8. Por ejemplo, si tienes §9 y §10, entonces §11 es una prueba de §12.

source: Intersection of a family of unions
es: Intersección de una familia de uniones.

source: To start a proof, you should look first at the goal. What needs to be done to prove the goal? In this level, the goal is §0. What does that tell you about how to proceed?
es: Para empezar una demostración, empieza mirando el objetivo.¿Qué necesitas hacer para demostrar el objetivo?En este nivel, el objetivo es §0. ¿Qué te dice eso sobre los pasos a dar?

source: So far the elements of all of our sets have been objects in the universe §0. But sets can contain other kinds of objects! In the next two worlds, we will work with sets whose elements are *sets of objects from §1*. We will call these *families of sets* from §2. To indicate that §3 is a family of sets from §4, we write §5. For example, suppose §6 contains the people in a certain club, and we want to form a committee consisting of five members of the club. The set of all possible committees is a family of sets from §7. Each element of this family is a set containing five club members. Families of sets are sets, and everything you've learned about sets applies to families of sets. For example, if you have §8 and §9, then §10 is a proof of the statement §11. Similarly, §12 is a proof of §13, and §14 is a proof of §15. In this world we extend the idea of intersections to families of sets. If §16 is a family of sets from §17, then the *intersection* of the family §18 is the set of all objects from §19 that belong to every element of §20.
es: Hasta ahora, los elementos de todos nuestros conjuntos han sido objetos del universo §0. Pero los conjuntos pueden contener otros tipos de objetos. En los dos mundos siguientes, trabajaremos con conjuntos cuyos elementos son *conjuntos de objetos de §1*. Llamaremos a estos *familias de conjuntos* de §2. Para indicar que §3 es una familia de conjuntos de §4, escribimos §5. Por ejemplo, supongamos que §6 contiene las personas de un cierto club, y queremos formar un comité de cinco miembros del club. El conjunto de todos los posibles comités es una familia de conjuntos de §7. Cada elemento de esta familia es un conjunto que contiene cinco miembros del club. Las familias de conjuntos son conjuntos, y todo lo que has aprendido sobre conjuntos se aplica a las familias de conjuntos. Por ejemplo, si tienes §8 y §9, entonces §10 es una prueba del enunciado §11. Similarmente, §12 es una prueba de §13, y §14 es una prueba de §15. En este mundo extendemos la idea de intersecciones a familias de conjuntos. Si §16 es una familia de conjuntos de §17, entonces la *intersección* de la familia §18 es el conjunto de todos los objetos de §19 que pertenecen a cada elemento de §20.

source: Since the goal is a subset statement, you should start by introducing an object §0 and the assumption that §1.
es: Como el objetivo es un enunciado de contenido, debes empezar introduciendoun objeto §0 y la hipótesis de que §1.

source: §0 is a proof of the goal, so §1 will close the goal.
es: §0 es una prueba del objetivo, así que §1 cerrará el objetivo.

source: Union of a family of intersections
es: Unión de una familia de intersecciones

source: Suppose §0 is a set and §1 is a family of sets. Then §2 is a subset of §3 if and only if every element of §4 is a subset of §5.
es: Supongamos que §0 es un conjunto y §1 es una familia de conjuntos. Entonces §2 es un subconjunto de §3 si y solo si cada elemento de §4 es un subconjunto de §5.

source: If you had §0 and §1, then §2 would prove the goal. So there are two ways to proceed. One possibility is to use §3 to introduce the assumptions §4 and §5--that is, if you can see how to justify those statements! Then you can use §6 to prove the goal. The second possibility is to use the §7 tactic. Recall that if you write §8, then Lean will figure out that the theorem §9 could be applied to prove the goal, if only you had proofs of §10 and §11. So it will set those two statements as goals, to be proven one after the other.
es: Si tuvieras §0 y §1, entonces §2 probaría el objetivo. Así que hay dos maneras de proceder. Una posibilidad es usar §3 para introducir las suposiciones §4 y §5 -- si puedes ver cómo justificar esas declaraciones-- Luego puedes usar §6 para probar el objetivo. La segunda posibilidad es usar la táctica §7. Recuerda que si escribes §8, entonces Lean se dará cuenta de que el teorema §9 podría aplicarse para probar el objetivo, solo necesitarías pruebas de §10 y §11. Entonces establecería esas dos declaraciones como objetivos, a ser probados uno tras otro.

source: If §0 and §1 are statements, then §2 means "if §3 then §4". To enter the symbol §5, type §6 (short for "implies"). The most straightforward way to prove a statement of the form §7 is to assume that §8 is true and then prove §9. To do that, we'll need a new tactic: §10.
es: Si §0 y §1 son afirmaciones, entonces §2 significa "si §3, entonces §4" Para ingresar el símbolo §5, escribe §6 (abreviatura de "implica"). La manera más directa de demostrar una afirmación de la forma §7 es asumir que §8 es verdadero y luego demostrar §9. Para hacer eso, necesitaremos una nueva táctica: §10.

source: If §0 and §1 are sets, then §2 is the union of §3 and §4. To enter the symbol §5, type §6.
es: Si §0 y §1 son conjuntos, entonces §2 es la unión de §3 y §4. Para escribir el símbolo §5, teclea §6.

source: Two families with an element in common
es: Dos familias con un elemento en común

source: Our goal in this level is again an equation between sets. In previous proofs of this kind, we've started with the tactic §0, and that would work here as well. But we're going to try out an alternative: the tactic §1. This tactic applies the principle of *extensionality* for sets, which says that if two sets have exactly the same elements, then they are equal.
es: Nuestro objetivo en este nivel es, de nuevo, una ecuación entre conjuntos. En pruebas anteriores de este tipo, hemos empezado con la táctica §0, y eso funcionaría aquí igual. Pero vamos a probar algo diferente: la táctica §1. Esta táctica aplica el principio de *extensionalidad* para conjuntos, que dice que si dos conjuntos tienen exactamente los mismos elementos, entonces son iguales.

source: Complement of a union
es: Complementario de una unión

source: In this world you'll prove theorems combining complements, intersections, and unions. For the most part, we'll leave you on your own to figure out these proofs.
es: En este mundo tendrás que demostrar teoremas combinando complementarios, intersecciones y uniones. Por lo general, te dejaremos solo para que descubras estas pruebas por ti mismo.

source: Of course, to start a subset proof you need to introduce an object §0 and an assumption §1.
es: Por supuesto, para empezar una prueba de un contenido necesitas introducir un objeto §0 y una hipótesis §1.

source: Subset World
es: Mundo de los subconjuntos

source: Subset is reflexive
es: La relación de contenido es reflexiva

source: In this level we have two families of sets, §0 and §1, with §2. In Family Intersection World, you proved that in this situation, §3. In this level, you'll prove that with family unions, it works the other way: §4. We'll need a new tactic for this proof. An assumption of the form §5 tells you that an object with a certain property exists. If you have such an assumption, then it is usually helpful to introduce a name for such an object. You can do this with the §6 tactic. If you write §7, then Lean will introduce a new object §8 and a new assumption §9. Thus, the object §10 is a witness for the existential assumption §11. Note that in the §12 tactic, §13 and §14 must be enclosed in angle brackets: §15. You can enter these by typing either §16 and §17 or §18 and §19.
es: En este nivel tenemos dos familias de conjuntos, §0 y §1, con §2. En el Mundo de la intersección de familias, demostraste que en esta situación, §3. En este nivel, probarás que con uniones de familias, funciona al revés: §4. Necesitaremos una nueva táctica para esta prueba. Una suposición de la forma §5 te dice que existe un objeto con cierta propiedad. Si tienes una hipótesis así, entonces suele ser útil introducir un nombre para tal objeto. Lo puedes hacer con la táctica §6. Si escribes §7, entonces Lean introducirá un nuevo objeto §8 y una nueva suposición §9. Por lo tanto, el objeto §10 es un testigo para la suposición existencial §11. Ten en cuenta que en la táctica §12, §13 y §14 deben estar encerrados en corchetes angulares: §15. Puedes escribirlos tecleando §16 y §17 o §18 y §19.

source: Subset is transitive
es: La relación de contenido es transitiva.

source: The theorem you have proven in this level shows that the subset relation has a property called *transitivity*. We have given the theorem the name §0.
es: El teorema que has demostrado en este nivel dice que la relación de contenido tiene una propiedad llamada *transitividad*. Hemos llamado a este teorema §0.

source: For any §0, §1, and §2, §3 is a proof of the statement §4.
es: Para cualquier §0, §1, y §2, §3 es una prueba del enunciado §4.

source: If §0 is a set, then §1 is a proof of §2.
es: Si §0 es un conjunto, entonces §1 es una prueba de §2.

source: The theorem §0 doesn't prove the goal, but it comes close. Do you see what assertion it will justify?
es: El enunciado §0 no demuestra el objetivo, pero se acerca mucho. ¿Ves qué afirmación justificará?

source: Next we'll prove the associative law for unions.
es: A continuación probaremos la ley asociativa para las uniones.

source: It would be helpful if you knew that §0. You can use §1 to assert it.
es: Sería útil tener que §0. Puedes utilizar §1 para afirmarlo.

source: The theorem you have proven in this level shows that the subset relation has a property called *reflexivity*. We have given the theorem the name §0. You will see it in the list of theorems on the right. (This theorem is included in Lean's mathematical library, Mathlib. In Mathlib, the name of the theorem is §1. Many other set-theoretic theorems in this game have §2 at the beginnings of their names in Mathlib.)
es: El teorema que has demostrado en este nivel muestra que la relación de ser subconjunto tiene una propiedad llamada *reflexividad*. Hemos dado al teorema el nombre §0. Lo verás en la lista de teoremas a la derecha. (Este teorema está incluido en la biblioteca matemática de Lean, *Mathlib*. En Mathlib, el nombre de este teorema es §1.Otros muchos teoremas sobre teoría de conjuntos de este juego están en Mathlib con nombres que empiezan por §2).

source: Suppose §0 is a set, §1 and §2 are families of sets, and for every set §3 in §4, §5. Then §6.
es: Supongamos que §0 es un conjunto, §1 y §2 son familias de conjuntos , y para todo conjunto §3 en §4, §5. Entonces §6.

source: Intersection of larger family is smaller
es: La intersección de una familia más grande, es más pequeña

source: The proof of the theorem in this level is very easy. Since §0 and §1 are definitionally equivalent, §2 will close the goal.
es: La demostración en este nivel es muy fácil. Como §0 y §1 son iguales por definición, §2 cerrará el objetivo.

source: For any sets §0, §1, and §2, §3 is a proof of the statement §4. Im Mathlib, the name of this theorem is §5.
es: Para cualesquiera conjuntos §0, §1 y §2, §3 es una prueba de §4. En Mathlib, el nombre de este teorema es §5.

source: You haven't used §0 yet. If you don't see how to use it, write out its definition.
es: No has utilizado §0 aún. Si no ves cómo usarlo, escribe su definición.

source: Suppose §0 and §1 are families of sets. Then §2.
es: Supongamos que §0 y §1 son familias de conjuntos. Entonces§2.

source: If you have an assumption §0, then the tactic §1 will introduce a new object §2 and a new assumption §3 into the proof. To enter the angle brackets §4, type either §5 and §6 or §7 and §8.
es: Si tienes una suposición §0, entonces la táctica §1 introducirá un nuevo objeto §2 y una nueva suposición §3 en la prueba. Para ingresar los corchetes angulares §4, teclea §5 y §6 o §7 y §8.

source: §0 means "if §1 then §2". You can enter the symbol §3 by typing §4. ### If your goal is §5 The tactic §6 will introduce the new assumption §7 into the proof, and set the goal to be §8. Be sure to use an identifier §9 that is not already being used to stand for some assumption. ### If you have an assumption §10 If you also have §11, then §12 is a proof of §13.
es: §0 significa "si §1 entonces §2". Puedes introducir el símbolo §3 tecleando §4. ### Si tu objetivo es §5 La táctica §6 introducirá la nueva hipótesis §7 en la prueba y establecerá §8 como el objetivo. Asegúrate de usar un identificador §9que no esté siendo utilizado para representar alguna hipótesis existente. ### Si tienes una hipótesis §10 Si también tienes §11, entonces §12 es una prueba de §13.

source: Now we're ready to start proving theorems about intersections.
es: Ahora estamos listos para comenzar a probar teoremas sobre intersecciones.

source: Notice that «{h}» is now a proof of the goal.
es: Observa que «{h}» es ahora una prueba del objetivo.

source: Now §0 is a proof of the statement §1, which tells us that we can reexpress the goal §2 as §3. To do this reexpression, use the tactic §4.
es: ahora §0 es una prueba de §1, lo que viene a decir que podemos reescribir el objetivo §2 como §3. Para hacer esta reescritura, usa la táctica §4.

source: The have tactic
es: La táctica have

source: And
es: Y

source: You know §0 and §1. So you can use §2 to get §3.
es: Sabes que §0 y que §1. Así que puedes usar §2 para obtener §3.

source: Family Union World
es: Mundo de la unión de familias

source: A tricky subset proof
es: Una prueba más difícil

source: This level shows that family intersections are a generalization of the intersections we studied in Intersection World. You'll prove that if §0 and §1 are sets, then §2 is equal to the intersection of the family of sets that contains just §3 and §4 and nothing else. We'll need notation for the family of sets consisting of just §5 and §6; we'll denote this family by §7. And, as usual, we'll need a theorem stating the definition of this notation. For any §8, §9, and §10, §11 is a proof of the statement §12.
es: Este nivel muestra que las intersecciones de familias son una generalización de las intersecciones que estudiamos en el mundo de las intersecciones. Vas a probar que si §0 y §1 son conjuntos, entonces §2 es igual a la intersección de la familia de conjuntos que contiene solo §3 y §4 y nada más. Necesitaremos notación para la familia de conjuntos consistente solo en §5 y §6; denotaremos a esta familia por §7. Y, como de costumbre, necesitaremos un teorema que establezca la definición de esta notación. Para cualquier §8, §9, y §10, §11 es una demostración del enunciado §12.

source: For any sets §0 and §1, §2 is a proof of the statement §3. In Mathlib, the name of this theorem is §4.
es: Para cualesquiera conjuntos §0 y §1, §2 es una prueba del enunciado §3. En Mathlib, el nombre de este teorema es §4.

source: Union of a union
es: Unión de una unión

source: Union distributes over intersection
es: Distributividad de la unión sobre la intersección

source: Intersection is a subset
es: La intersección está contenida en los conjuntos intersecados.

source: The situation now should remind you of your first proof, in level 1 of this world.
es: La situación ahora debería recordarte a tu primera demostración, en el nivel 1 de este mundo.

source: You should be able to combine ideas from previous levels to solve this one.
es: Deberías ser capaz de combinar ideas de niveles anteriores para resolver este.

source: To start on this proof, try writing out the meaning of intersection in §0.
es: Para empezar con esta prueba, intenta escribir el significado de intersección en §0.

source: §0 will close the goal.
es: §0 cerrará el objetivo.
