Repository: djvelleman/STG4
Catalog: .i18n/*/Game.po
Languages: es

source: If §0 is a of objects from the universe §1, then §2 is the complement of §3; that is, §4 is the set of objects from §5 that are not elements of §6. You can enter the symbol §7 by typing §8 or §9.
es: Si §0 es un conjunto de objetos del universo §1, entonces §2 es el complementario de §3; es decir, §4 es el conjunto de objetos de §5 que no son elementos de §6. Puedes ingresar el símbolo §7 escribiendo §8 o §9.

source: Intersection of a pair
es: Intersección de un par

source: This example is a better illustration of how the §0 tactic is usually used. Often §1 is followed by an expression that combines assumptions to prove the goal. In later levels, we will see other ways in which assumptions can be combined to prove a goal. Note that in this proof, §2 could be thought of as a function that can be applied to a proof of any statement of the form §3 to produce a proof of §4. Many proofs in Lean behave like functions.
es: Este ejemplo ilustra mejor cómo se usa normalmente la táctica §0. A menudo, §1 va seguido de una expresión que combina hipótesis para demostrar el objetivo. En niveles posteriores, veremos otras formas en las que las hipótesis se pueden combinar para demostrar un objetivo. Observa que en esta prueba, §2 podría pensarse como una función que se puede aplicar a una prueba de cualquier afirmación de la forma §3 para producir una prueba de §4. Muchas pruebas en Lean se comportan como funciones.

source: By the way, another set that would have worked as a witness for the existential goal in this theorem is the empty set, denoted §0. However, to justify the use of that witness you would have had to prove §1. Since we already have the theorem §2, it was easier to use §3 as the witness. Now that you know how to prove existential statements, you're ready to start working with unions of families.
es: Por cierto, otro conjunto que habría funcionado como testigo para el objetivo existencial en este teorema es el conjunto vacío, denotado §0. Sin embargo, para justificar el uso de ese testigo habrías tenido que probar §1. Dado que ya tenemos el teorema §2, fue más fácil usar §3 como testigo. Ahora que sabes cómo probar enunciados existenciales, estás listo para comenzar a trabajar con uniones de familias.

source: It may help you see how to proceed if you separate out the second half of §0 as a separate assumption. You can do this with §1.
es: Para ver cómo proceder, puede ser útil tener la segunda mitad de §0 como una suposición separada. Puedes hacer esto con §1.

source: Union is commutative
es: La unión es conmutativa.

source: intermediate goal solved! 🎉
es: ¡objetivo intermedio resuelto! 🎉

source: §0 will prove the goal.
es: §0 probará el objetivo.

source: Union is associative
es: La unión es asociativa

source: You can use the §0 tactic to work backwards from the goal. Suppose you think that you will be able to use some theorem §1 to prove the goal. In other words, you think there is a proof of the goal of the form §2, where the question mark needs to be replaced with a proof of some statement §3 to which the theorem §4 must be applied. The tactic §5 will then set §6 as your goal. If §7 must be applied to more than one proof to establish the goal, then §8 will set all of the needed proofs as goals.
es: Puedes usar la táctica §0 para trabajar hacia atrás desde el objetivo.Supongamos que piensas que podrás utilizar algún teorema §1 para probar elobjetivo. En otras palabras, crees que hay una prueba del objetivo de la forma §2, donde el signo de interrogación necesita ser reemplazado por una prueba de algún enunciado §3 a la que se le debe aplicar el teorema §4. La táctica §5 entonces establecerá §6 como tu objetivo. Si §7 debe aplicarse a más de una prueba para establecer el objetivo, entonces §8 establecerá todas las pruebas necesarias como objetivos.

source: If §0 represents a statement about §1, then §2 means "there is at least one §3 such that §4 is true". To enter the symbol §5, type §6. ### If your goal is §7 If you have §8, for some object §9, then §10 is a proof of §11, so §12 will close the goal. If you think §13 is true, but you don't yet have a proof of it, then §14 will set §15 as your goal. The tactic §16 does the same thing, but it also tries to prove §17; if it doesn't succeed, then it leaves §18 as a goal for you to prove. ### If you have an assumption §19 The tactic §20 will introduce a new object §21 and a new assumption §22 into the proof. To enter the angle brackets §23, type either §24 and §25 or §26 and §27.
es: Si §0 representa una afirmación sobre §1, entonces §2 significa "hay al menos un §3 tal que §4 es cierto". Para introducir el símbolo §5, teclea §6. ### Si tu objetivo es §7 Si tienes §8, para algún objeto §9, entonces §10 es una prueba de §11, así que §12 completará el objetivo. Si crees que §13 es cierto, pero aún no tienes una prueba, entonces §14 establecerá §15 como tu objetivo. La táctica §16 hace lo mismo, pero tambiénintenta probar §17; si no lo consigue, deja §18 como el objetivo que debes probar. ### Si tienes una hipótesis §19 La táctica §20 introducirá un nuevo objeto §21 y una nueva hipótesis §22 en la prueba. Para introducir losparéntesis angulados §23, teclea §24 y §25 o §26 y §27.

source: If §0 represents a statement about §1 and you have §2, for some object §3, then §4 is a proof of §5.
es: Si §0 representa un enunciado sobre §1 y tienes §2, para algún objeto §3, entonces §4 es una prueba de §5.

source: For the theorem in this level, your goal is §0. To use proof by contradiction in this proof, you must begin by introducing the assumption §1. To do that, type §2
es: Para el teorema en este nivel, tu objetivo es §0. Para utilizar la prueba por contradicción en esta demostración, debes comenzar introduciendo la suposición §1. Para hacerlo, escribe §2.

source: If §0 represents a statement about an unspecified object §1, then §2 means "for all §3, §4 is true". To enter the symbol §5, type §6. ### If your goal is §7 The tactic §8 will introduce a new object §9 into the proof, and set the goal to be §10. Be sure to use a variable §11 that is not already being used to stand for some object. ### If you have an assumption §12 If §13 stands for some object, then §14 is a proof of §15. Note that §16 must be the right *type* of object. For example, if §17 stands for an object in the universe §18, then §19 must have type §20; if §21 stands for a set of objects from the universe §22, then §23 must have type §24.
es: Si §0 representa una afirmación sobre un objeto sin especificar §1, entonces §2 significa "Para todo §3, se cumple §4". Para introducir el símbolo §5, teclea §6. ### Si tu objetivo es §7 La táctica §8 introducirá un nuevo objeto §9 en la prueba, y establecerá que el objetivo pase a ser §10. Asegúrate de usar una variable §11 que no esté ya siendo usada para otro objeto. ### Si tienes una hipótesis §12 Si §13 representa un objeto, entonces §14 es una prueba de §15. Notar que §16 debe ser un objeto del *tipo* adecuado. Por ejemplo, si §17 es un objeto del universo §18, entonces §19 debe ser del tipo §20; si §21 representa un conjunto de objetos del universo §22, entonces §23 debe ser del tipo §24.

source: If §0 and §1 are sets, then the *union* of §2 and §3, denoted §4, is the set you get by throwing all the elements of §5 and §6 together into one set. In other words, for an object to be an element of §7, it must be an element of either §8 or §9, or both. For example, if §10 is the set of all people under 30, and §11 is the set of all people over 20, then §12 is the set of all people. In this world you'll prove some basic properties of unions of sets.
es: Si §0 y §1 son conjuntos, entonces la *unión* de §2 y §3, denotada §4, es el conjunto que se obtiene al poner todos los elementos de §5 y §6 juntos en un solo conjunto. En otras palabras, para que un objeto sea un elemento de §7, debe ser un elemento de §8 o de §9, o de ambos. Por ejemplo, si §10 es el conjunto de todas las personas menores de 30, y §11 es el conjunto de todas las personas mayores de 20, entonces §12 es el conjunto de todas las personas. En este mundo demostrarás algunas propiedades básicas de uniones de conjuntos.

source: §0 means that §1 is an element of §2. To enter the symbol §3, type §4 or §5.
es: §0 significa que §1 es un elemento de §2. Para introducir el símbolo §3, teclea §4 or §5 seguido de un espacio.

source: Since your goal is an "if and only if" statement, a good next step is §0.
es: Dado que tu objetivo es un enunciado "si y solo si", un buen siguientepaso es §0.

source: Suppose §0. Then §1.
es: Supongamos §0. Entonces §1.

source: Implication
es: Implicaciones

source: Notice that §0 could be applied to a proof of §1 to prove the goal. That means that §2 will set §3 as the goal.
es: Fíjese que §0 se puede aplicar a una prueba de §1 para probar el objetivo. Eso significa que §2 establecerá §3 como el objetivo.

source: Union of a pair
es: Unión de un par

source: Your goal says that there is a set that is a subset of §0. The theorem §1 suggests such a set.
es: Tu objetivo indica que hay un conjunto que es un subconjunto de §0. El teorema §1 sugiere tal conjunto.

source: The §0 tactic is often useful for writing out definitions. For more information about how it works, click on §1 in the list of tactics on the right. You can also use §2 instead of §3. (There is actually a small difference between the tactics §4 and §5, but the difference won't concern us in this game.) You'll find the theorem you proved in this level listed as §6 in the list of theorems on the right. This theorem will be useful in the last level of this world.
es: La táctica §0 es útil a menudo para reescribir definiciones. Para obtener más información sobre cómo funciona, pulsa en §1 en la lista de tácticas a la derecha. También puedes usar §2 en lugar de §3. (De hecho, hay una pequeña diferencia entre las tácticas §4 y §5, pero esa diferencia no nos preocupará en este juego). Encontrarás el teorema que demostraste en este nivel listado como §6 en la lista de teoremas a la derecha. Este teorema será útil en el último nivel de este mundo.

source: Do you see how you can now use the theorem from the previous level?
es: ¿Ves cómo ahora puedes usar el teorema del nivel anterior?

source: Notice that §0 has been added to the list of assumptions. Can you complete the proof now?
es: Observa que §0 se ha añadido a la lista de suposiciones. ¿Puedes completar la demostración ahora?

source: You can use §0 to write out the meaning of the goal.
es: Puedes usar §0 para escribir el significado del objetivo.

source: A theorem about three families
es: Un teorema sobre tres familias

source: A set that must be a singleton
es: Un conjunto que debe ser un elemento único

source: Note that Lean also has a §0 tactic, but the syntax is a little more complicated. That's why we have chosen to use the §1 tactic. The §2 tactic has other uses. However, in this game we will be using it only with assumptions that are "or" statements, to break the proof into cases.
es: Ten en cuenta que Lean también tiene una táctica §0, pero la sintaxis es un poco más complicada. Por eso hemos decidido utilizar la táctica §1. La táctica §2 tiene otros usos, pero en este juego solo lo utilizaremos con hipótesis de tipo "o", para dividir la prueba en casos.

source: Your immediate goal now is to prove that §0. Once you close that goal, you'll be asked to prove the second goal, §1.
es: Tu objetivo inmediato ahora es probar que §0. Una vez que cierres ese objetivo, tendrás que demostrar el segundo objetivo, §1.

source: Suppose §0 and §1 are sets, §2, and §3. Then §4.
es: Supongamos que §0 y §1 son conjuntos, §2, y §3. Entonces §4.

source: If §0 and §1 are sets, then the *intersection* of §2 and §3, denoted §4, is the set of elements that the two sets have in common. In other words, for an object to be an element of §5, it must be an element of both §6 and §7. For example, if §8 is the set of all round things, and §9 is the set of all red things, then §10 is the set of all round red things. In this world you'll prove some basic properties of intersections of sets.
es: Si §0 y §1 son conjuntos, entonces la *intersección* de §2 y §3, denotada por §4, es el conjunto de elementos que los dos conjuntos tienen en común. En otras palabras, para que un objeto sea un elemento de §5, debe ser un elemento tanto de §6 como de §7. Por ejemplo, si §8 es el conjunto de todas las cosas redondas y §9 es el conjunto de todas las cosas rojas, entonces §10 es el conjunto de todas las cosas redondas rojas. En este mundo demostrarás algunas propiedades básicas de las intersecciones de conjuntos.

source: Now you have *two* goals. For the first, the assumption §0 has been replaced with §1, and for the second it has been replaced with §2. In both cases, you must prove §3. The two identifiers after §4 in the §5 tactic are used as the identifiers of the new assumptions in the two cases.
es: Ahora tienes *dos* objetivos. Para el primero, la hipótesis §0 ha sido reemplazada con §1, y para el segundo ha sido reemplazada con §2. En ambos casos, debes probar §3. Los dos identificadores después de §4 en la táctica §5 se usan como los identificadores de las nuevas hipótesis en los dos casos.

source: If §0 is a family of sets from §1, then the *union* of §2 is the set of all objects from §3 that belong to at least one element of §4. We'll investigate unions of families in this world.
es: Si §0 es una familia de conjuntos de §1, entonces la *unión* de §2 es el conjunto de todos los objetos de §3 que pertenecen al menos a un elemento de §4. Investigaremos uniones de familias en este mundo.

source: Suppose §0 and §1 are families of sets and §2. Then §3.
es: Supongamos que §0 y §1 son familias de conjuntos, y §2. Entonces §3.

source: Once again, Lean has left out some parentheses that it regards as unnecessary. Lean gives intersection higher precedence than union, so it interprets §0 as §1.
es: De nuevo, Lean ha omitido algunos paréntesis que considera innecesarios. Lean da preferencia a la intersección sobre la unión, así que interpreta §0 como §1.

source: Do you know which half of the goal you're going to prove now?
es: ¿Sabes qué mitad del objetivo vas a probar ahora?

source: If you have §0, §1, and §2, then §3 is a proof of the statement §4. In Mathlib, the name of this theorem is §5.
es: Si tienes §0, §1, y §2, entonces §3 es una prueba del enunciado §4. En Mathlib, el nombre de este teorema es §5.

source: Of course, you should begin by introducing the assumption §0.
es: Por supuesto, debes comenzar introduciendo la suposición §0.

source: A subset hypothesis
es: Una hipótesis sobre subconjuntos

source: Since our goal in this level is the statement §0, our first step for this proof is to assume §1. To introduce that assumption, assigning it the identifier §2, type §3.
es: Como nuestro objetivo es §0, el primer paso es asumir §1. Para introducir esta hipótesis asignándole el identificador §2, teclea §3.

source: In this level we have two families of sets, §0 and §1, with §2. That means that §3 is the intersection of a family of sets that includes all the sets in §4, plus perhaps more sets. You're going to prove that intersecting this larger collection of sets leads to a smaller result; more precisely, you're going to prove that §5. Of course, by now you know how to start a proof that one set is a subset of another.
es: En este nivel tenemos dos familias de conjuntos, §0 y §1, con §2. Esto significa que §3 es la intersección de una familia de conjuntos que incluye todos los conjuntos en §4, más quizás más conjuntos. Vas a probar que intersecar esta colección más grande de conjuntos lleva a un resultado más pequeño; más precisamente, vas a probar que §5. Por supuesto, ya sabes cómo empezar una prueba de que un conjunto es un subconjunto de otro.

source: §0 means "it is not the case that §1". To enter the symbol §2, type §3. ### If your goal is §4 You may be able to use the §5 tactic to reexpress the goal as an equivalent positive statement. If not, then a good strategy is to use proof by contradiction. The tactic §6 will introduce the assumption §7, and set the goal to be §8. ### If you have an assumption §9 You may be able to use the tactic §10 to reexpress this assumption as an equivalent positive statement. Lean treats §11 as meaning §12, so if you also have §13, then §14 will be a proof of §15. That means that if you are doing a proof by contradiction, so your goal is §16, then §17 will close the goal.
es: §0 significa "no es cierto que §1". Para introducir el símbolo §2, teclea §3. ### Si tu objetivo es §4 Podrías utilizar la táctica §5 para reexpresar el objetivo como una afirmación positiva equivalente. Si eso no funciona, una buena estrategia es usar demostración por reducción al absurdo. La táctica §6 introducirá la hipótesis §7 y establecerá §8 como el objetivo. ### Si tienes una suposición §9 Podrías utilizar la táctica §10 para reexpresar esta suposición como una afirmación positiva equivalente. Lean interpreta §11 como si fuera §12, por lo que si también tienes §13, entonces §14 será una prueba de §15. Eso significa que si estás realizando una demostración por reducción al absurdo y tu objetivo es §16, entonces §17 cerrará el objetivo.

source: In this level, we'll need to use the definition of "intersection". The theorem that expresses that definition is called §0. If you have §1, §2, and §3, then §4 is a proof of the statement §5. As we saw in Complement World, that means that the tactic §6 can be used to replace §7 in the goal with §8. Usually Lean can figure out §9, §10, and §11 on its own, so you can just write §12, and you can use §13 to do the replacement in an assumption §14 rather than the goal. Like §15, §16 can be proven by using the §17 tactic. But we won't ask you to prove it; it is pre-defined in this game. To enter the symbol §18, you can type §19 or §20.
es: En este nivel, necesitaremos usar la definición de "intersección". El teorema que expresa esa definición se llama §0. Si tienes §1, §2 y §3, entonces §4 es una prueba del enunciado §5. Como vimos en el Mundo de los complementarios, eso significa que la táctica §6 puede utilizarse para reemplazar §7 en el objetivo por §8. Por lo general, Lean puede averiguar por sí mismo §9, §10 y §11, así que puedes escribir simplemente §12, y puedes usar §13 para hacer lo mismo en una hipótesis §14 en lugar del objetivo. Al igual que §15, §16 puede probarse utilizando la táctica §17. Pero no te pediremos que lo pruebes; ya está predefinido en este juego. Para escribir el símbolo §18, puedes teclear §19 o §20.

source: We'll prove one more property of intersections in the next level.
es: Probaremos una propiedad más de las intersecciones en el siguiente nivel.

source: Suppose §0 and §1 are families of sets. Then §2.
es: Supongamos que §0 y §1 son familias de conjuntos. Entonces §2.

source: If §0 and §1 are sets, then §2 is the intersection of §3 and §4. To enter the symbol §5, type §6 or §7.
es: Si §0 y §1 son conjuntos, entonces §2 es la intersección de §3 y §4. Para escribir el símbolo §5, teclea §6 o §7.

source: Fortunately, we can use the theorem §0 to prove §1 and §2, and those statements should get us from §3 to the goal. We have seen in previous levels that the §4 tactic can be applied to a proof of a statement of the form §5 to replace §6 with §7. The tactic can also be applied to equations: if §8 is a proof of an equation §9, then §10 will replace §11 with §12.
es: Por suerte, podemos usar el teorema §0 para probar §1 y §2, y esos enunciados deberían llevarnos desde §3 hasta el objetivo. Hemos visto en niveles anteriores que la §4 puede aplicarse a una prueba de un enunciado de la forma §5 para reemplazar §6 con §7. La táctica también puede aplicarse a ecuaciones: si §8 es una prueba de una ecuación §9, entonces §10 reemplazará §11 por §12.

source: Notice that Lean has introduced the new object §0 into the proof, and your goal is now §1. Proving this goal will show that §2 and §3 have exactly the same elements, and by the principle of extensionality, that will show that the sets are equal.
es: Ten en cuenta que Lean ha introducido el nuevo objeto §0 en la prueba, y su objetivo ahora es: §1. Probar este objetivo demostrará que §2 y §3 tienen exactamente los mismos elementos, y por el principio de extensionalidad, eso demostrará que los conjuntos son iguales.

source: If you have §0, §1, and §2, then §3 is a proof of the statement §4. In Mathlib, the name of this theorem is §5.
es: Si tienes §0, §1, y §2, entonces §3 es una prueba del enunciado §4. En Mathlib, el nombre de este teorema es §5.

source: Now §0 proves the goal.
es: Ahora §0 prueba el objetivo.

source: Now we're ready to start proving theorems about unions.
es: Ahora estamos listos para empezar a probar teoremas sobre uniones.

source: Congratulations! You have completed your first verified proof! Although this theorem was trivial, it illustrates an important fact: although we called §0 an *identifier* for the assumption §1, it is also recognized by Lean as a *proof* of the statement §2. Any time you see §3 listed as an assumption, where §4 is some statement, that means that Lean will recognize §5 as a proof of the statement §6. Remember that §7 is a *tactic*. If you ever want information about the §8 tactic, you can click on §9 in the list of tactics on the right. Note that, although §10 was a proof of the goal §11, you could not have closed the goal by simply typing §12 in the text box. Throughout this game, every move you make must invoke a tactic. Now click on "Next" to see a more interesting use of the §13 tactic.
es: ¡Enhorabuena! Has completado tu primera demostración. Aunque este teorema era trivial, ilustra un hecho importante: aunque llamamos a §0 un *identificador* para la suposición §1, también es reconocido por Lean como una *prueba* de la afirmación §2. Cada vez que veas §3 enumerado como una suposición, donde §4 es alguna afirmación, eso significa que Lean reconocerá §5 como una prueba de la afirmación §6. Recuerda que §7 es una *táctica*. Si alguna vez quieres obtener información sobre la táctica §8, puedes pulsar en §9 en la lista de tácticas a la derecha. Ahora pulsa en "Next" para ver un uso más interesante de la táctica §10.

source: Intersection is associative
es: La intersección es asociativa

source: What happens if you intersect §0 with §1, for two families §2 and §3?
es: ¿Qué sucede si intersecas §0 con §1, para dos familias §2 y §3?

source: The notation §0 denotes a set whose only element is §1; such a set is called a *singleton* set. The theorem §2 expresses the definition of singleton sets: §3 is a proof of any statement of the form §4.
es: La notación §0 denota un conjunto cuyo único elemento es §1; un conjunto de este tipo se llama *singleton*. El teorema §2 expresa la definición de conjuntos singleton: §3 es una prueba de cualquier enunciado de la forma §4.

source: You've finished Family Intersection World! As you might guess, you can also take the union of a family of sets. Can you guess how to define it? Continue on to Family Union World to see if your guess is right.
es: ¡Terminaste el mundo de las intersecciones de familias! Como probablemente hayas adivinado, también puedes tomar la unión de una familia de conjuntos. ¿Puedes adivinar cómo definirla? Continúa en el mundo de la unión familiar para ver si aciertas.

source: Intersection distributes over union
es: Distributividad de la intersección sobre la unión

source: §0 will change §1 to §2, and §3 will change §4 to §5. In fact, you can do both rewrites in one step: §6.
es: La táctica §0 cambiará §1 por §2, en la hipótesis §3, y el comando §4 cambiará §5 por §6. De hecho, puedes realizar ambos cambios en un solo paso: §7.

source: Proof by cases
es: Demostración por casos
