Repository: djvelleman/STG4
Catalog: .i18n/*/Game.po
Languages: es

source: In this level you'll prove a generalization of the theorem §0 that you proved in Combination World. That theorem was about the complement of a union of two sets; the theorem in this level is about the complement of a union of a family of sets. As in the case of §1, you have a choice about how to deal with the negations that arise when you write out the meaning of complement. You can use the §2 tactic to reexpress negative statements, or you can use proof by contradiction.
es: En este nivel, demostrarás una generalización del teorema §0 que probaste en el mundo combinado. Ese teorema trataba sobre el complemento de la unión de dos conjuntos; el teorema en este nivel trata sobre el complemento de la unión de una familia de conjuntos. Como en el caso de §1, puedes elegir cómo lidiar con las negaciones que surgen cuando escribes el significado del complemento. Puedes usar la táctica §2 para re-expresar declaraciones negativas, o puedes hacer una prueba por contradicción.

source: If you have §0 and §1, then §2 is a proof of the statement §3. In Mathlib, the name of this theorem is §4.
es: Si tienes §0 y §1, entonces §2 es una prueba de la afirmación §3.

source: As we saw in the last level, §0 is now a proof of the goal, so §1 will close the goal.
es: Como vimos en el anterior nivel, §0 es ahora una prueba del objetivo, así que §1 cerrará el objetivo.

source: You probably used §0 several times in this proof. Recall that two §1 steps in a row can be combined into one step. Click on §2 in the list of tactics on the right for further details.
es: Probablemente usaste §0 varias veces en esta prueba. Recuerda que dos pasos de §1 consecutivos pueden combinarse en un solo paso. Haz clic en §2 en la lista de tácticas a la derecha para obtener más detalles.

source: Does your situation now remind you of a previous level?
es: ¿Te recuerda esta situación al nivel anterior?

source: If your goal is §0, for some statement §1, then the tactic §2 will introduce the new assumption §3, and set the goal to be §4. If your goal is a statement §5 that is not a negative statement, then §6 will introduce the new assumption §7. To achieve your new goal, you will need to establish §8 and §9, for some statement §10. If you can do that, then §11 will prove the goal §12. Notice that §13 will not be recognized as a proof of §14; the negative statement must come first.
es: Si tu objetivo es §0, para alguna afirmación §1, entonces la táctica§2 introducirá la nueva suposición §3 y establecerá el objetivo como §4. Si tu objetivo es una afirmación §5 que no es negativa,entonces §6 introducirá la nueva suposición§7.Para lograr tu nuevo objetivo, deberás establecer§8 y §9, para alguna afirmación §10. Si puedes hacer eso,entonces §11 demostrará el objetivo §12. Observa que §13 no será reconocido como una prueba de §14; la afirmación negativa debe venir primero.

source: level completed with warnings… 🎭
es: Nivel completado con advertencias... 🎭

source: As usual, if you're not sure how to proceed then writing out definitions can help.
es: Como de costumbre, si no sabes cómo seguir; escribir las definiciones puede ser útil.

source: Note that you can apply §0 to §1. You'll need to include the parentheses around §2 when you do that.
es: Ten en cuenta que se puede aplicar §0 a §1. Para ello, debes incluir los paréntesis alrededor de §2 cuando lo hagas.

source: Writing out the definition of union in the goal should help you see how to proceed.
es: Escribir la definición de unión en el objetivo debería ayudarte a ver cómo seguir.

source: Lean will recognize §0 as a proof of any statement of the form §1. In Mathlib, the name of this theorem is §2.
es: Lean reconocerá §0 como una prueba de cualquier enunciado de la forma §1. En Mathlib, el nombre de este teorema es §2.

source: To get started on this proof, type §0 in the text box and click "Execute" or hit "Return" or "Enter". Recall that you can enter the symbol §1 by typing §2 or §3.
es: Para iniciar esta prueba, teclea §0 en la caja de texto y pulsa "Execute" o la tecla "Return" o "Enter". Recuerda que puedes introducir el símbolo §1 tecleando §2 or §3.

source: §0 is a proof of the goal.
es: §0 es una prueba del objetivo.

source: Since we also have §0, you can apply §1 to §2 to prove that §3. This means that §4 is a proof of the goal.
es: Como también tenemos §0, puedes aplicar §1 a §2 para probar que §3. Esto significa que §4 es una prueba del objetivo.

source: To make use of §0, you'll need to assert §1. If you don't see right away how to justify this assertion, you can just write §2 and Lean will set §3 as your immediate goal. Once you achieve that goal, Lean will add §4 to your list of assumptions, and you can continue with the proof of your original goal. For further details, click on §5 in the list of tactics on the right.
es: Para usar §0, necesitarás afirmar §1. Si no ves de inmediato cómo justificar esta afirmación, puedes simplemente escribir §2 y Lean establecerá §3 como tu objetivo inmediato. Una vez que logres ese objetivo, Lean agregará §4 a tu lista de suposiciones y podrás continuar con la prueba de tu objetivo original. Para obtener más detalles, haz clic en §5 en la lista de tácticas a la derecha.

source: This time we'll study the intersection of §0 and §1.
es: Esta vez estudiaremos la intersección de §0 y §1.

source: For the proof in this level, §0 will create the goals §1 and §2.
es: Para la prueba en este nivel, §0 creará los objetivos §1 y §2.

source: If §0, then the goal is easy to prove. This suggests breaking the proof into cases depending on whether or not §1. You can do this with the tactic §2.
es: Si §0, entonces es fácil probar el objetivo. Esto sugiere dividir la prueba en casos según si §1 o no. Puedes hacerlo con la táctica §2.

source: To work with intersections, we'll need to understand the word "and". If §0 and §1 are statements, then §2 means "§3 and §4". To enter the symbol §5, type §6. For the statement §7 to be true, §8 and §9 must both be true. If you have §10--that is, §11 is a proof of the statement §12--then in Lean, §13 is a proof of §14 and §15 is a proof of §16. That should be all you need to know to solve this level.
es: Para trabajar con intersecciones, necesitaremos entender la palabra "y" Si §0 y §1 son enunciados, entonces §2 significa " §3 y §4". Para escribir el símbolo §5, teclea §6. Para que la declaración §7 sea verdadera, tanto §8 como §9 deben ser verdaderos. Si tienes §10-- es decir, §11 es una prueba del enunciado §12--entonces en Lean, §13 es una prueba de §14 y §15 es una prueba de §16. Eso debería ser todo lo que necesitas saber para resolver este nivel.

source: Try §0 or §1.
es: Intenta §0 o §1.

source: For any sets §0, §1, and §2, §3 is a proof of the statement §4. In Mathlib, the name of this theorem is §5.
es: Para cualesquiera conjuntos §0, §1 y §2, §3 es una prueba del enunciado §4. En Mathlib, el nombre de este teorema es §5.

source: If you're stuck at this point, it may help you see how to proceed if you separate out the first half of §0 as a separate assumption. You can do this with §1.
es: Si te atascas en este punto, te puede ser útil si separar la primera mitad de §0 como una suposición separada. Puedes hacer esto con §1.

source: In this proof, we'll need a new proof technique: proof by cases. And we'll need a new tactic to implement that technique in Lean: §0.
es: En esta prueba, necesitaremos una nueva técnica de demostración: demostración por casos. Y necesitaremos una nueva táctica para implementar esa técnica en Lean: §0.

source: There are two ways to complete the proof now. Since your goal is a negative statement, one natural strategy to use would be proof by contradiction. A second possibility is to imitate the approach in the first half: write out the meaning of complement again in the goal, and then use the §0 tactic to simplify the resulting double-negative goal. Either approach will work.
es: Hay dos formas de completar la prueba ahora. Dado que tu objetivo es un enunciado negativo, una estrategia natural que puedes usar sería la prueba por contradicción. Una segunda posibilidad es imitar el enfoque en la primera mitad: escribe de nuevo el significado del complementario en el objetivo y luego utiliza la táctica §0 para simplificar la doble negación resultante. Cualquiera de los dos enfoques funcionará.

source: In order to complete this proof, type §0 in the text box under the goal and click on "Execute" or hit the "Return" or "Enter" key.
es: Para completar esta prueba, teclea §0 en la caja de texto bajo el objetivo y haz click en "Execute" o pulsa le tecla "Return" o "Enter".

source: The assumption §0 now says §1, which means §2. It will be helpful to write out the definition of complement again in this assumption.
es: La suposición §0 ahora dice §1, lo que significa §2. Sería útil escribir de nuevo la definición del complemento en esta suposición.

source: Notice that the goal is now §0. To achieve that goal, you must prove contradictory statements. You can do that by using §1 to assert §2, which will contradict §3.
es: Observa que el objetivo es ahora §0. Para lograr ese objetivo, debes demostrar afirmaciones contradictorias. Puedes hacer esto usando §1 para afirmar §2, lo cual contradirá a §3.

source: Writing out the definition of intersection in the goal will help.
es: Escribir la definición de intersección en el objetivo ayudará.

source: As usual, you may find it helpful to use the §0 tactic to write out the definition of §1, using the theorem §2.
es: Como de costumbre, puede que resultar útil utilizar la táctica §0para escribir la definición de §1, utilizando el teorema §2.

source: Proving a conjunction
es: Demostrar una conjunción

source: As usual, to prove a subset statement you need to introduce both a new object §0 and a new assumption §1. You can do it in one step with §2.
es: Como de costumbre, para demostrar un contenido, necesitas introducir un nuevoobjeto §0 y una nueva suposición §1. Puedes hacerlo de golpe con §0.

source: You need to apply §0 to a family of sets with two properties: the union of the family must be §1, and knowing that §2 belongs to the family must help you prove that §3 is a singleton.
es: Debes aplicar §0 a una familia de conjuntos con dos propiedades: la unión de la familia debe ser §1, y saber que §2 pertenece a la familia debe ayudarte a probar que §3 es un singleton.

source: The proof of the second goal is similar.
es: La prueba del segundo objetivo es similar.

source: If your goal has the form §0, then the tactic §1 will replace this goal with the two goals §2 and §3. If your goal has the form §4, then §5 will replace this goal with the two goals §6 and §7. There are other situations in which the §8 tactic can be used, but these two are the ones that are most relevant for the set theory game.
es: Si tu objetivo es de le forma §0, la táctica §1 reemplazará el objetivo por dos objetivos §2 y §3. Si tu objetivo es de la forma §4, entonces §5 lo reemplazará por dos objetivos §6 y §7. Hay otras situaciones en las que la táctica §8 puede servir, pero estas dos son las más relevantes para el juegode teoría de conjuntos.

source: Your goal is a subset statement. That should tell you how to get started.
es: Tu objetivo es ver un contenido. Eso debería decirte cómo empezar.

source: Of course, you know by now how to start a proof that one set is a subset of another.
es: Por supuesto, ahora ya sabes como empezar una demostración de que uno está contenido en el otro.

source: Start with §0. The hard part is figuring out how to fill in the §1.
es: Comienza con §0. La parte difícil es descubrir cómo llenar el §1.

source: You've mastered reasoning about complements, intersections, and unions. In the next world, we'll start mixing them up!
es: Dominaste el razonamiento sobre complementarios, intersecciones y uniones. ¡En el próximo mundo, empezaremos a combinarlos!

source: Again, work out the consequences of §0 first.
es: En primer lugar, trabaja en las consecuencias de §0.

source: You probably used a step like §0 in this proof. That step is actually optional. Writing out the definition of intersection probably helps *you* understand how to proceed with the proof, but *Lean* doesn't need to be told to write out the definition. It will do that on its own. In other words, if you have §1, Lean will accept §2 as a proof of §3.
es: Probablemente usaste un paso como §0 en esta prueba. Ese paso es, de hecho, opcional. Escribir la definición de intersección probablemente te ayude a comprender cómo proceder con la prueba, pero *Lean* no necesita saber que escriba la definición. Lo hará por sí mismo. En otras palabras, si tienes §1, Lean aceptará§2 como una prueba de §3.

source: Now you can use §0 to prove the goal.
es: Ahora puedes usar §0 para probar el objetivo.

source: Suppose §0 is a set and §1 is a family of sets. In this level you'll determine the conditions under which §2 is a subset of §3.
es: Supongamos que §0 es un conjunto y que §1 es una familia de conjuntos. En este nivel, determinarás las condiciones bajo las cuales §2 es un subconjunto de §3.

source: Now that you have §0, you can use §1 to replace §2 with §3 in the goal.
es: Ahora que tienes §0, puedes utilizar §1 para reemplazar §2 con §3 en el objetivo.

source: Whew!
es: ¡Uf!

source: The exact tactic
es: La táctica exact

source: §0 means "§1 if and only if §2". You can enter the symbol §3 by typing §4. ### If your goal is §5 If §6 and §7 are definitionally equivalent, then §8 will close the goal. If you have §9 and §10, then §11 is a proof of §12, so §13 will close the goal. If you don't yet have proofs of §14 and §15, then §16 will set §17 and §18 as your goals. In this situation, the tactic §19 has the same effect as §20. ### If you have an assumption §21 Lean will recognize §22 as a proof of §23 and §24 as a proof of §25. You may also find it helpful to use §26 in the §27 tactic.
es: §0 significa "§1 si y solo si §2". Puedes introducir el símbolo §3 tecleando §4. ### Si tu objetivo es §5 Si §6 y §7 son equivalentes por definición, entonces §8 cerrará el objetivo.Si tienes §9 y §10, entonces §11 es una prueba de §12,así que §13 cerrará el objetivo.Si aún no tienes pruebas de §14 y §15, entonces §16 establecerá a §17y §18 como tus objetivos. En esta situación, la táctica §19 tiene el mismo efecto que§20. ### Si tienes una hipótesis §21 Lean reconocerá §22 como una prueba de §23 y §24 como una prueba de §25. Tambiénpuede serte útil utilizar §26 en la táctica §27.

source: Complement of a complement
es: Complementario de un complementario

source: Lean will recognize §0 is a proof of any statement of the form §1. In Mathlib, the name of this theorem is §2.
es: Lean reconocerá que §0 es una prueba de cualquier enunciado de la forma §1. En Mathlib, el nombre de este teorema es §2.

source: Notice that you have contradictory assumptions. You can prove anything from contradictory assumptions. Do you see how?
es: Fíjate en que tienes suposiciones contradictorias. Puedes probar cualquier cosa a partir de suposiciones contradictorias. ¿Ves cómo?

source: In this level, §0 and §1 are families of sets, and you'll work out how §2 is related to §3 and §4.
es: En este nivel, §0 y §1 son familias de conjuntos, y tendrás que averiguar cómo se relaciona §2 con §3 y §4.

source: You can use §0 to justify the assertion §1.
es: Puedes usar §0 para justificar laafirmación §1.

source: If you have §0 and §1, then §2 is a proof of §3. In Mathlib, the name of this theorem is §4.
es: Si tienes §0 y §1, entonces §2 es una prueba de §3. En Mathlib, el nombre de este teorema es §4.

source: A union intersected with the complement of another is a subset
es: Una unión intersecada con el complemento de otra es un subconjunto.

source: In mathematical writing, the union of the family §0 is usually denoted §1. In Lean, the union of a family §2 is denoted §3. (You can enter the symbol §4 by typing §5.) Suppose we have §6 and §7. Then §8 means that there is at least one set §9 such that §10 and §11. To write this statement in Lean, we write §12. Lean abbreviates this statement as §13. As with other set theory operations, we have a theorem that expresses this definition. Lean will recognize §14 as a proof of any statement of the form §15. In this level, you'll try out these ideas.
es: En la notación matemática, la unión de la familia §0 suele denotarse como §1.En Lean, la unión de una familia §2 se denota con §3. (Puedes obtener el símbolo §4 tecleando §5.) Supongamos que tenemos §6 y §7. Entonces, §8 significa que hay al menos un conjunto §9 tal que §10 y §11. Para escribir este enunciado en Lean, escribimos §12. Lean abrevia este enunciado como §13 Como con otras operaciones de la teoría de conjuntos, tenemos un teorema que expresa esta definición. Lean reconocerá §14 como una prueba de cualquier declaración del tipo §15. En este nivel, probarás estas ideas.

source: Next, we'll see how to prove that a union is a subset of another set.
es: A continuación, veremos cómo probar que una unión es un subconjunto de otro conjunto.

source: If §0 and §1 are sets, then we say that §2 is a *subset* of §3 if every element of §4 is also an element of §5. The notation §6 means that §7 is a subset of §8. (To enter the symbol §9, type §10, followed by a space.) If you have §11, then §12 is a proof that, if something is an element of §13, then it is also an element of §14. Thus, if you also have §15, then you can apply §16 to §17 to conclude that §18. To apply §19 to §20, you simply write §21 followed by §22, with a space between them. Thus, in this situation, §23 is a proof of §24. See if you can use this to complete this level. If you need a hint, click on "Show more help!".
es: Si §0 and §1 son conjuntos, decimos que §2 es un *subconjunto* de §3 si todo elemento de §4 es también un elemento de §5. Esto lo denotamos como §6. (Para introducir el símbolo §7, teclea §8, seguido por un espacio.) Si tienes §9, entonces §10 is una prueba de que, si algo es un elemento de §11, también es un elemento de §12. Así, si tienes también §13, puedes aplicar §14 a §15 para concluir que §16. Para aplicar §17 a §18, simplemente escribe §19 seguido de §20, con un espacio en medio. Así, en esta situación, §21 es una prueba de §22. Intenta completar este nivel. Si necesitas ayuda, pulsa en "Show more help!".

source: Now you can use §0 to complete the proof.
es: Ahora puedes usar §0 para completar la prueba.

source: To finish off Combination World, we'll do one more tricky theorem.
es: Para terminar el mundo combinado, haremos un último teorema algo más difícil.

source: # Welcome to the Set Theory Game #### An introduction to mathematical proof. In this game, you will solve a sequence of levels by proving theorems. The game is based on an interactive theorem prover called *Lean*. The theorems in this game will be about sets. A *set* is a collection of objects; the objects in the collection are called *elements* of the set. For example, the set of planets in our solar system has eight elements: Mercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus, and Neptune. # Read this. Learning how to use an interactive theorem prover takes time. You will get the most out of this game if you read the help texts like this one. To start, click on "Subset World". ## More Open "Game Info" in the "≡" menu on the top right for resources, links, and ways to interact with the Lean community.
es: # Bienvenido al Juego de Teoría de Conjuntos #### Una introducción a la prueba matemática. En este juego, resolverás una secuencia de niveles demostrando teoremas. El juego se basa en un verificador de teoremas interactivo llamado *Lean*. Los teoremas de este juego serán sobre conjuntos. Un *conjunto* es una colección de objetos; los objetos en la colección se denominan *elementos* del conjunto. Por ejemplo, el conjunto de planetas en nuestro sistema solar tiene ocho elementos: Mercurio, Venus, Tierra, Marte, Júpiter, Saturno, Urano y Neptuno. # Importante. Aprender a usar un verificador de teoremas interactivo toma tiempo. Obtendrás el máximo beneficio de este juego si lees los textos de ayuda como este. Para comenzar, haga clic en "Subset World". ## Más Abra "Información del juego" en el menú "≡" en la esquina superior derecha para recursos, enlaces y formas de interactuar con la comunidad de Lean.

source: The tactic §0 breaks the proof into two cases. In the first case, the assumption §1 is added to the list of assumptions, and in the second case, the assumption §2 is added.
es: La táctica §0 divide la prueba en dos casos. En el primer caso, se añade la suposición §1 a la lista de suposiciones y en el segundo caso, se añade la suposición §2.

source: If §0 is a set and §1 is a family of sets, under what circumstances is it the case that §2? In this level you'll discover the answer to that question.
es: Si §0 es un conjunto y §1 es una familia de conjuntos, ¿bajo qué circunstancias es cierto que §2? En este nivel descubrirás la respuesta a esa pregunta.

source: Complement of an intersection
es: Complementario de una intersección

source: In general, if your goal has the form §0, then the tactic §1 will add §2 to the list of assumptions and set §3 to be the goal. If you have assumptions §4 and §5, then §6 is a proof of §7. This is another example of a proof acting like a function: a proof of §8 can be thought of as a function which, when applied to a proof of §9, produces a proof of §10. As usual, for more information about the new tactic §11, you can click on §12 in the list of tactics on the right.
es: En general, si tu objetivo es de la forma §0, la táctica §1 añadirá §2 a la lista de hipótesis, y establecerá §3 como el objetivo a probar. Si tienes hipótesis §4 y §5, §6 es una prueba de §7. Este es otro ejemplo de una prueba funcionando como una función: una prueba de §8 se puede ver como una función que, cuando se aplica a §9 produce una prueba de §10. Como de costumbre, para más información sobre la táctica §11, puedes pulsar en §12 en la lista de tácticas de la derecha.

source: Or
es: O

source: It will help to get as much information as you can out of §0 before addressing the goal.
es: Te será útil obtener tanta información como puedas de §0 antes de abordar el objetivo.

source: Remember that §0 is an abbreviation for §1. Since §2 means "for all", §3 can be applied to any set--that is, we can plug in any set for §4 in §5. In particular, applying it to the set §6, we can conclude that §7. To apply §8 to §9, we just write §10 followed by §11, with a space between them. Thus, your next step can be §12. You can save yourself a little typing by writing §13; Lean will figure out what statement is proven by §14.
es: Recuerda que §0 es una abreviatura de §1. Dado que §2 significa "para todo", §3 puede aplicarse a cualquier conjunto, es decir, podemos sustituir cualquier conjunto por §4 en §5. En particular, al aplicarlo al conjunto §6, podemos concluir que §7. Para aplicar §8 a §9, simplemente escribimos §10 seguido de §11, con un espacio entre ellos. Así, tu siguiente paso puede ser §12. Puedes ahorrarte un poco de tecleo escribiendo §13; Lean entenderá qué enunciado se prueba con §14.

source: Just as you were able to apply §0 to §1 in the last step, you can now apply §2 to §3 to prove the goal.
es: Igual que pudiste aplicar §0 a §1 en el paso anterior, ahora puedes aplicar §2 a §3 para probar el objetivo.

source: You can use the §0 tactic to add a new statement to your list of assumptions, as long as you can justify it with a proof. For further information, click on §1 in the list of tactics on the right.
es: Puedes usar la táctica §0 para añadir una afirmación a tu lista de suposiciones, siempre que puedas justificarla con una demostración. Para más información, pulsa en §1 en la lista de tácticas a la derecha.
