Repository: djvelleman/STG4
Catalog: .i18n/*/Game.po
Languages: es

source: Use §0 to assert a statement that you can prove from your current assumptions. You must give the new assertion an identifier; be sure to use an identifier that is different from those already in use. If some expression §1 is a proof of a statement §2, and §3 is an identifier that is not in use, then §4 will add §5 to the list of assumptions. There are two variations on the §6 tactic: * Sometimes you want to assert a statement §7, but the proof of §8 is too difficult to be given in one line. In that situation, you can simply write §9. Of course, you must still justify the assertion of §10, so the proof of §11 becomes your immediate goal. Once the goal of proving §12 has been closed, you will be able to return to your original goal, with §13 added to the assumption list. * If you write §14, then Lean will try to figure out what statement §15 is proven by the expression §16 and, if it can figure it out, it will fill it in for you.
es: Usa §0 para afirmar una declaración que puedes probar a partir de tus suposiciones actuales. Debes darle a la nueva afirmación un identificador; asegúrate de usar un identificador que sea diferente de los que ya se están utilizando. Si alguna expresión §1 es una prueba de una afirmación §2, y §3 es un identificador que no está en uso, entonces §4 agregará §5 a la lista de suposiciones. Hay dos posibles formas de usar la táctica §6: * A veces quieres afirmar una declaración §7, pero la prueba de §8 es demasiado difícil para ser dada en una sola línea. En esa situación, simplemente puedes escribir §9. Por supuesto, aún debes justificar la afirmación de §10, así que la prueba de §11 se convierte en tu objetivo inmediato. Una vez que se haya cerrado el objetivo de demostrar §12, podrás volver a tu objetivo original, con §13 añadido a la lista de suposiciones. * Si escribes §14, entonces Lean intentará deducir qué afirmación §15 es probada por §16, y si puede hacerlo, directamente añadirá una nueva hipótesis §17.

source: Suppose §0 is a family of sets and §1. Then §2.
es: Supongamos que §0 es una familia de de conjuntos, y §1. Entonces §2.

source: How do you prove that one set is a subset of another? To prove that §0, you have to show that if some object §1 is an element of §2, then it is also an element of §3. To do that, you'll have to introduce an object called §4 into the proof. The object denoted by §5 could be anything, so we say that it is *arbitrary*. In this level, we start with a simple example of this kind of proof. We're going to show that if §6 is a set, then §7.
es: ¿Cómo demuestras que un conjunto es un subconjunto de otro? Para demostrar que §0, tienes que mostrar que si algún objeto §1 es un elemento de §2, entonces también lo es un elemento de §3. Para hacer eso, tendrás que introducir un objeto §4 en la prueba. Este elemento §5 podría ser cualquiera, así que decimos que es *arbitrario*. En este nivel, comenzamos con un ejemplo simple de este tipo de prueba. Vamos a mostrar que si §6 es un conjunto, entonces §7.

source: Suppose §0, §1, and §2. Then §3.
es: Supongamos §0, §1, y §2. Entonces §3.

source: In this level, we introduce another way to define sets. If §0 is a statement about an unspecified object §1, then §2 denotes the set of all values of §3 that make §4 come out true. This is often called *set-builder notation*. For example, §5 is another way to write §6. As usual, we have a theorem that states the meaning of set-builder notation. Lean will recognize §7 as a proof of any statement of the form §8. And that means that §9 will rewrite §10 as §11.
es: En este nivel, introducimos otra forma de definir conjuntos. Si §0 es un enunciado sobre un objeto no especificado §1, entonces §2 denota el conjunto de todos los valores de §3 que hacen que §4 sea verdadero. Esto a menudo se llama *notación constructora de conjuntos*. Por ejemplo, §5 es otra forma de escribir §6. Como de costumbre, tenemos un teorema que establece el significado de la notación constructora de conjuntos. Lean reconocerá §7 como una prueba de cualquier enunciado de la forma §8. Y eso significa que §9 reescribirá §10 como §11.

source: Intersection of a union of families
es: Intersección de una unión de familias

source: Now write out the definition of complement in §0.
es: Ahora escribe la definición de complementario en §0.

source: Our first step is to introduce an object §0 into the proof. To do this, type §1. We have already seen that the §2 tactic can be used to introduce a new *assumption* into a proof. This step illustrates a second use of §3: introducing a new *object* into a proof.
es: Nuestro primer paso es introducir un objeto §0 en la prueba. Para hacer esto, escribe §1. Ya hemos visto que la táctica §2 se puede utilizar para introducir una nueva *suposición* en una prueba. Este paso ilustra un segundo uso de §3: introducir un nuevo *objeto* en una prueba.

source: The form of the assumption §0 now suggests proof by cases.
es: El aspecto de la hipótesis §0 ahora sugiere prueba por casos.

source: For any family of sets §0, §1.
es: Para toda familia de conjuntos §0, §1.

source: Suppose §0 is a set. Then there is some set §1 such that §2.
es: Supongamos que §0 is a set. Entonces existe un conjunto §1 tal que §2.

source: Now use §0.
es: Ahora usa `h1.

source: If §0 is a proof of a statement of the form §1, then the tactic §2 will break your proof into cases. In case 1, you'll have the new assumption §3, and in case 2 you'll have §4. In both cases you have to prove the original goal. The §5 tactic has other uses. In particular, it can be applied to proofs of statements that do not have the form §6. However, we will not discuss these other uses of the §7 tactic in this game.
es: Si §0 es una prueba de un enunciado de la forma §1, entonces la táctica §2 dividirá tu prueba en casos. En el caso 1, tendrás la nueva suposición §3, y en el caso 2 tendrás §4. En ambos casos tienes que probar el objetivo original. La táctica §5 tiene otros usos. En particular, puede aplicarse a pruebas de enunciados que no tienen la forma §6. Sin embargo, no discutiremos estos otros usos de la táctica §7 en este juego.

source: Now the assumption §0 is an "or" statement. The easiest way to use such an assumption is to break your proof into cases. To do this in Lean, use the tactic §1.
es: Ahora la hipótesis §0 es una afirmación de tipo "o". La forma más fácil de usar tal suposición es dividir tu prueba en casos. Para hacer esto en Lean, usa la táctica §1.

source: For any sets §0, §1, and §2, §3 is a proof of the statement §4. In Mathlib, the name of this theorem is §5.
es: Para cualesquiera conjuntos §0, §1 y §2, §3 es una prueba del enunciado §4. En Mathlib, el nombre de este teorema es §5.

source: In this last level of Complement World, you'll prove a statement of the form §0. The most useful theorem for this purpose is §1. If you have §2 and §3, then §4 is a proof of §5. As we saw in the last level, that means you can start your proof with §6. Lean will set §7 and §8 as the goals that are needed to complete the proof.
es: En este último nivel del mundo de complementarios, demostrarás un enunciado dela forma §0. El teorema más útil para este propósito es §1. Si tienes §2 y §3, entonces §4 es una prueba de §5. Como vimos en el último nivel, eso significa que puedes comenzar tu prueba con §6. Lean establecerá §7 y §8 como los objetivos que deben ser probados para completar la demostración.

source: Combination World
es: Mundo combinado

source: If §0 is a set of objects from the universe §1, then the *complement* of §2, denoted §3, is the set of all objects in the universe §4 that are *not* elements of §5. For example, if §6 consists of all people and §7 is the set of people who are more than 6 feet tall, then §8 is the set of all people who are at most 6 feet tall. In this world, we'll see how to prove theorems about complements.
es: Si §0 es un conjunto de objetos del universo §1, entonces el *complementario* de §2, denotado §3, es el conjunto de todos los objetos en el universo §4 que no son elementos de §5. Por ejemplo, si §6 consiste en todas las personas y §7 es el conjunto de personas que miden más de 2 metros, entonces §8 es el conjunto de todas las personas que miden a lo sumo 2 metros. En este mundo, veremos cómo probar teoremas sobre complementarios.

source: §0 is now a proof of the goal.
es: §0 es ahora una prueba del objetivo.

source: If your goal is a statement of the form §0, and §1 and §2 are definitionally equivalent (that is, equivalent by virtue of the definitions of the symbols occurring in them), then the §3 tactic will close the goal. It will also close a goal of the form §4, if §5 and §6 are definitionally equal (that is, equal by virtue of definitions).
es: Si tu objetivo es una afirmación de la forma §0, y §1 y §2 son equivalentes por definición (es decir, equivalentes por virtud de las definiciones de los símbolos que aparecen en ellas), entonces la táctica §3 cerrará el objetivo. También cerrará un objetivo de la forma §4, si §5 e §6 son iguales por definición.

source: In this game you will learn the basics of theorem proving in Lean by proving theorems about unions, intersections, and complements of sets.
es: En este juego aprenderás los conceptos básicos de prueba de teoremas en Lean al probar teoremas sobre uniones, intersecciones y complementos de conjuntos.

source: §0 is the union of the family of sets §1. To enter the symbol §2, type §3.
es: La expresión §0 representa la unión de la familia de conjuntos §1. Para ingresar el símbolo §2, escribe §3.

source: Notice that Lean has written the goal as §0, with no parentheses on the left. When an intersection of more than two sets is written without parentheses, Lean groups the intersections to the left, so this means §1. To start this proof, use the tactic §2.
es: Fíjate en que Lean ha escrito el objetivo como §0, sin paréntesis a la izquierda. Cuando se escribe una intersección de más de dos conjuntos sin paréntesis, Lean agrupa las intersecciones hacia la izquierda, así que esto significa §1. Para iniciar esta prueba, use la táctica §2.

source: Remember, you can use §0 to introduce a name for the set that is asserted to exist in §1.
es: Recuerda que puedes usar §0 para introducir un nombre para el conjunto que §1 afirma que existe.

source: Congratulations! You have completed the Set Theory Game! If you want to learn more about Lean, check out the [Lean Community](https://leanprover-community.github.io).
es: Enhorabuena! Has completado el Juego de Teoría de Conjuntos. Si quieres aprender más sobre Lean, visita la [Comunidad Lean](https://leanprover-community.github.io).

source: Notice that, as with intersections, Lean groups unions to the left, so §0 means §1.
es: Ten en cuenta que, al igual que con las intersecciones, Lean agrupa uniones a la izquierda, por lo que §0 significa §1.

source: In this level you'll need a new kind of proof by cases. For any statement §0, the tactic §1 will break the proof into two cases. In the first case, the new assumption §2 is added to the list of assumptions, and in second, the new assumption §3 is added. Since §4 must be either true or false, these two cases cover all possibilities.
es: En este nivel necesitarás un nuevo tipo de prueba por casos. Para cualquier enunciado §0, la táctica §1 dividirá la prueba en dos casos.En el primer caso, se añade la nueva suposición §2 a la lista de suposiciones y en segundo lugar, se añade la nueva suposición §3. Dado que §4 debe ser verdadero o falso, estos dos casos cubren todas las posibilidades.

source: If you have §0 and §1, then §2 is a proof of §3.
es: Si tienes §0 y §1, entonces §2 es una prueba de §3.

source: The §0 tactic is smart enough to figure out some things on its own. If you had just written §1, then Lean would have figured out how to apply the theorem §2 to get an equivalence that could be used to make a replacement in the goal. In other words, it would have figured out that the theorem §3 had to be applied to §4 and §5. Similarly, you can write §6 to write out the meaning of §7. Lean will figure out that in this case, §8 has to be applied to §9 and §10.
es: La táctica §0 es suficientemente inteligente para deducir algunas cosas por sí misma. Si hubieras escrito solamente §1, Lean habría deducido como aplicar el teorema §2 para obtener una equivalencia que pueda usarse para hacer una reescritura en el objetivo. En otras palabras, habría deducido que el teorema §3 tenía que aplicarse a §4 y §5. Análogamente, puedes escribir §6 para reescribir el significado de«{h2}»§7mem_compl_iff§8B§9«{x}»`.

source: Element of an intersection
es: Elementos de una intersección

source: In mathematical writing, the intersection of the family §0 is usually denoted §1. In Lean, the intersection of a family §2 is denoted §3. (You can enter the symbol §4 by typing §5.) Suppose we have §6 and §7. Then §8 means that for every set §9, if §10 is in §11, then §12. To write this statement in Lean, we write §13. Lean abbreviates this statement as §14. The symbol §15 is called the *universal quantifier*, and you can enter it in Lean by typing §16. Note that §17 means §18, not §19. In other words, Lean interprets the universal quantifier as applying to the entire rest of the statement. If you want it to apply to less, you have to use parentheses to indicate that. As with other set theory operations, we have a theorem that expresses this definition. Lean will recognize §20 as a proof of any statement of the form §21. In this level, you'll try out these ideas.
es: En lenguaje matemático, la intersección de la familia §0 se denota generalmente como §1.En Lean, la intersección de una familia §2 se denota como §3. (Puedes introducir el símbolo §4 tecleando §5.)Supongamos que tienes §6 y §7. Entonces §8 significa que para todo conjunto §9, si §10 está en §11, entonces §12. Para escribir esta afirmación en Lean, escribimos §13.Lean abbrevia esta declaración como §14.El símbolo §15 se llama *cuantificador universal*, y puedes introducirlo en Lean tecleando §16. Notar que §17 significa §18, no§19. Es decir, Lean interpreta el cuantificador universal como aplicándose a toda la expresión restante. Si quieres que aplique a solo una parte, debes usar paréntesis para indicarlo.Como con otras operaciones de teoría de conjuntos, tenemos un teorema que expresa esta definición. Lean reconocerá §20 como una prueba de cualquier afirmación del tipo §21.En este nivel, podrás aplicar estas ideas.

source: You can think of §0 (which is shorthand for §1) as meaning "if §2 were true, then that would lead to a contradiction"--in other words, §3. Applying this to your new assumption §4 will give the contradiction you need. In other words, §5 will close the goal.
es: Puedes pensar en §0 (que es una forma abreviada de §1) como significando "si §2 fuera verdadero, eso conduciría a una contradicción"--dicho de otro modo, §3. Aplicar esto a tu nueva suposición §4 dará la contradicción que necesitas. En otras palabras, §5 cerrará el objetivo.

source: Subset of a union
es: Subconjunto de una unión

source: You can separate out the first half of §0 with §1.
es: Puedes separar la primera mitad de §0 con §1.
